[
  {
    "id": "a_meeting_of_fates",
    "alternative_mission": "If you are playing a campaign, you can choose to play this mission instead of the <a href=\"/missions/view/disrupt_supply_lines\">Disrupt Supply Lines</a> mission.",
    "battle_length": "Use the Variable Battle Length rules (Commanders, pg 19) - the player with the greatest advantage (determined during deployment) rolls. In addition, if there is only one unbroken kill team on the battlefield at the end of a battle round, the battle ends.",
    "contributor": "DestructorNZ",
    "deployment": "Use the Standard Deployment rules (Commanders, pg 19).",
    "description": "Every commander is acutely aware of their own importance to the war effort - and that of the officers who oppose them. Should a chance encounter present them with an opportunity to eliminate one of their adversaries, they must seize it, knowing that should they succeed they will greatly advance their cause.",
    "four_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fmeeting_of_fates_4_player.png?alt=media&token=67fed5cc-4dbe-462b-a952-fd94b183090c",
    "page": "114",
    "requiresCommander": true,
    "resources": "In a campaign game, the player(s) that lose the mission each lose 1 Materiel and 1 Intelligence. If players draw they do not lose Materiel or Intelligence.",
    "scouting_phase": "Resolve the Scouting phase as described in the Kill Team Core Manual.",
    "source": "Commanders Rulebook",
    "specialRules": "In this mission, a player's kill team is never considered to be broken whilst their Commander is on the battlefield. However, a player's kill team is automatically broken at the end of the Morale phase in a battle round in which their Commander was taken out of action.",
    "specialRules2Title": "",
    "specialRulesTitle": "Inspiring Presence",
    "the_battlefield": "Create the battlefield and set up terrain. Examples of how you might do this are shown below.",
    "the_kill_teams": "This is a mission for two to four players. Each player chooses a Faction keyword and the players reveal their choices at the same time. Then each player chooses a Battle-forged kill team (see the Kill Team Core Manual) that only includes models with the Faction keyword they chose. Each kill team can cost up to 200 points, and must include one Commander.",
    "title": "A Meeting of Fates",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fmeeting_of_fates_2_player.png?alt=media&token=61038874-7b8c-4a63-952a-755d7ba10671",
    "type": "Matched Play Mission",
    "uuid": "a_meeting_of_fates",
    "victory_conditions": "If the battle ends because there is only one unbroken kill team on the battlefield, that kill team's player wins. Otherwise, each player scores 1 victory point for each enemy Commander taken out of action by one of their models' attacks or psychic powers. The player with the most victory points is the winner. If players are tied for the most victory points, whichever of those players had the lower Force is the winner. If there is still a tie for the most victory points, the tied players draw. Any other players lose."
  },
  {
    "id": "aerial_strike",
    "battle_length": "The battle automatically ends at the end of battle round 5.",
    "deployment": "The defender sets up their models, anywhere on the battlefield. Divide the battlefield into four even quarters and number them 1-4. The attacker then rolls a D6 for each of their models. On a 1-4, that model is set up in the quarter corresponding to the number rolled. On a 5-6, the attacker may pick which quarter the model is set up in. The attacker's models must be set up more than 4\" from any of the defender’s models.",
    "description": "Sometimes the only way to get troops into a critical fortified position is from above, dropping from the sky on grav-chutes or by other means to sabotage vital enemy equipment.",
    "map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2F386225.png?alt=media&token=2711fb29-31ec-438a-8de0-8151534ebbfd",
    "page": "50",
    "scouting_phase": "Do not use the rules for the Scouting phase in this mission",
    "source": "Core Rulebook",
    "the_battlefield": "Create the battlefield and set up terrain. The defender then places 3 objective markers anywhere on the battlefield. Each objective marker must be at least 6\" from other objective markers.",
    "the_kill_teams": "<p>This is a mission for two players. Choose which player will be the attacker and which will be the defender (roll off if you can't agree – the winner decides). Each player chooses a kill team (see page 62 of the core rulebook).</p>",
    "title": "Aerial Strike",
    "type": "Open Play Mission",
    "uuid": "aerial_strike",
    "victory_conditions": "If any of the attacker’s models are within 1\" of an objective marker at the end of a battle round, they may attempt to destroy it. Roll a D6 for each of those models. On a 5+, that objective is destroyed: remove it from the battlefield. At the end of the battle, each objective marker is worth 2 victory points to the attacker if it has been destroyed or 2 victory points to the defender if it is still on the battlefield. Each player also scores 1 victory point for each enemy specialist that is out of action at the end of the battle. The player with the most victory points is the winner. If the players have the same number of victory points, the defender wins."
  },
  {
    "id": "against_the_odds",
    "battle_length": "The battle ends at the end of battle\nround 5.",
    "deployment": "The defender first sets up their\nentire kill team anywhere wholly\nwithin 5\" of one of the short edges\nof the battlefield. The attacker\nthen sets up their entire kill team\nanywhere wholly within 5\" of the\nopposite edge of the battlefield.",
    "description": "Cornered and vastly outnumbered, a small team of diehards prepares to overcome insurmountable\nodds or perish in the attempt.",
    "page": "135",
    "scouting_phase": "Resolve the Scouting phase\nas described in the Kill Team\nCore Manual.",
    "source": "Elites Rulebook",
    "specialRules": "Subtract 2 (rather than 1) from\nNerve tests taken for the defender’s\nmodels for each other model (do\nnot count shaken models) from\ntheir kill team that is within 2\".",
    "specialRulesTitle": "Last Stand",
    "the_battlefield": "Create the battlefield and set\nup terrain.",
    "the_kill_teams": "This is a mission for two players.\nChoose which player will be the\nattacker and which will be the\ndefender (roll off if you can’t agree\n– the winner decides). Each player\nchooses a kill team. The defender’s\nkill team cannot include more than\n5 models, and the attacker’s kill\nteam cannot include fewer than\n10 models.",
    "title": "Against The Odds",
    "type": "Open Play Mission",
    "uuid": "against_the_odds",
    "victory_conditions": "If, at the end of the battle, the\ndefender’s models are all shaken\nor out of action, the attacker wins.\nOtherwise, the defender wins."
  },
  {
    "id": "all-out_attack",
    "alternative_mission": "If you are playing a campaign, you can choose to play this mission instead of the <a href=\"/missions/view/terror_tactics\">Terror Tactics</a> mission.",
    "battle_length": "Use the Variable Battle Length rules (pg 19) - the player with the greatest advantage (determined during deployment) rolls. In addition, if there is only one unbroken kill team on the battlefield at the end of a battle round, the battle ends.",
    "contributor": "DestructorNZ",
    "deployment": "Use the Standard Deployment rules (pg 19).",
    "description": "Commanders are often found where the fighting is fiercest, leading their warriors to victory. Yet they cannot be everywhere at once, so commanders must rely on those that fight alongside them to do their part, for only together can they hope to strike the enemy hardest.",
    "four_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fall_out_attack_4_player.png?alt=media&token=7cd4312d-eda8-4087-8646-029e7eb9bff1",
    "page": "118",
    "requiresCommander": true,
    "resources": "In a campaign game the player(s) that lose the mission each lose 1 Materiel and 1 Territory. If players draw tlley do not lose Materiel or Territory.",
    "scouting_phase": "Resolve the Scouting phase as described in the Kill Team Core Manual.",
    "source": "Commanders Rulebook",
    "specialRulesTitle": "",
    "the_battlefield": "Create the battlefield and set up terrain. Examples of how you might do this are shown below.",
    "the_kill_teams": "This is a mission for two to four players. Each player chooses a Faction keyword, and the players reveal their choices at the same time. Then each player chooses a Battle-forged kill team (see the Kill Team Core Manual) that only includes models with the Faction keyword they chose. Each kill team can cost up to 200 points, and must include one Commander.",
    "title": "All-out Attack",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fall_out_attack_2_player.png?alt=media&token=12186575-fdd4-4bb2-b664-106c3ca716be",
    "type": "Matched Play Mission",
    "uuid": "all-out_attack",
    "victory_conditions": "If the battle ends because there is only one unbroken kill team on the battlefield, that kill team's player wins. Otherwise, each player scores 3 victory points for each enemy Commander taken out of action by one of their models' attacks or psychic powers, 2 victory points for each other enemy specialist taken out of action by one of their models' attacks or psychic powers, and 1 victory point for each other enemy model taken out of action by one of their models' attacks or psychic powers. The player with the most victory points is the winner. If players are tied for the most victory points, whichever of those players had the lower Force is the winner. If there is still a tie for the most victory points, tlle tied players draw. Any other players lose."
  },
  {
    "id": "all_or_nothing",
    "battle_length": "The battle ends at the end of battle\nround 5.",
    "deployment": "The players alternate setting up\nmodels, starting with the defender.\nIf a player runs out of models to\nset up, skip them. Continue setting\nup models until both players have\nset up their kill team. A player’s\nmodels must be set up wholly\nwithin their deployment zone.",
    "description": "As their fortunes in the ongoing war begin to wane, one side decides on an all-or-nothing gambit – a\nstrike by their mightiest warriors to eliminate a key enemy strategist, in an attempt to change destiny.",
    "page": "135",
    "scouting_phase": "Do not use the rules for the\nScouting phase in this mission.",
    "source": "Elites Rulebook",
    "the_battlefield": "Create the battlefield and set up\nterrain. The defender picks one\nhalf of the battlefield to be their\ndeployment zone. The other half\nof the battlefield is the attacker’s\ndeployment zone.",
    "the_kill_teams": "This is a mission for two players.\nChoose which player will be the\nattacker and which will be the\ndefender (roll off if you can’t\nagree – the winner decides). Each\nplayer chooses a kill team that may\ninclude one Commander.",
    "title": "All Or Nothing",
    "type": "Open Play Mission",
    "uuid": "all_or_nothing",
    "victory_conditions": "At the end of the battle, each\nplayer scores 3 victory points if\nthe enemy Leader is out of action,\n5 victory points if an enemy\nCommander is out of action, and\n1 victory point for each other\nenemy model that is out of action.\nThe player with the most victory\npoints is the winner. If there is\na tie, the defender wins if their\nLeader and/or Commander is still\non the battlefield, otherwise the\nattacker wins."
  },
  {
    "id": "ambush",
    "alternative_mission": "If you are playing a campaign, you can choose to play\n<a  href=\"/missions/view/rampage\">Rampage</a> or <a  href=\"/missions/view/surrounded\">Surrounded</a> instead of this mission.",
    "attackerTactic": "you're_going_nowhere",
    "battle_length": "If the defender’s models are all either shaken, out\nof action or have escaped (see right) at the end of a\nbattle round, the battle ends. If not, at the end of battle\nround 4, the attacker rolls a D6. The battle continues on a 3+, otherwise the battle ends. If the battle doesn’t\nend as described above, at the end of battle round\n5, the attacker again rolls a D6. This time the battle\ncontinues on a 4+, otherwise the battle ends. The battle\nautomatically ends at the end of battle round 6.",
    "defenderTactic": "slink_away",
    "deployment": "The players alternate setting up models, starting with the\ndefender. If a player runs out of models to set up, skip\nthem. Continue setting up models until both players\nhave set up their kill teams. A player’s models must be\nset up wholly within their deployment zone. Once the\nplayers have set up all their models, deployment ends\nand the first battle round begins.",
    "description": "When a choke point is found, a kill team can cause significant damage to a superior force. Canny\ncommanders will send their kill teams to hold these areas, setting ambushes that will restrict enemy\nmovement and potentially cause disproportionate damage to their foes.",
    "page": "53",
    "resources": "In a campaign game (see page 202) if the attacker wins\nthe mission, the defender loses 1 Intelligence and 1\nTerritory. If the defender wins the mission, the attacker\nloses 1 Territory.",
    "scouting_phase": "Resolve the Scouting phase as described on page 49.",
    "source": "Core Rulebook",
    "specialRules": "The defender can move their models off the edge of\nthe battlefield labelled ‘escape route’ in the Movement\nphase, if that model’s move is sufficient to take it wholly\nover the edge of the battlefield. A model that escapes\nthis way is not considered to be out of action, but takes\nno further part in the mission.",
    "specialRulesTitle": " Escape",
    "the_battlefield": "Create the battlefield and set up terrain. An example\nof how you might do this is shown below. The players\nroll off, and the player that wins chooses which of the\nshort edges of the battlefield their deployment zone\nis touching.",
    "the_kill_teams": "This is a mission for two players. Choose which player will\nbe the attacker and which will be the defender (roll off if\nyou can’t agree – the winner decides). Each player chooses\na Faction keyword, and the players reveal their choices at\nthe same time. Then each player chooses a Battle-forged\nkill team (see page 62) that only includes models with the\nFaction keyword they chose, but the defender can spend an\nadditional 20 points on their kill team.",
    "title": "Ambush",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fambush_map.png?alt=media&token=3f12d838-4022-401b-9c6a-d7fb4dda8d9f",
    "type": "Narrative Play Mission",
    "uuid": "ambush",
    "victory_conditions": "If, at the end of the battle, more of the defender’s models\nescaped (see below) than did not escape, the defender\nwins. Otherwise, the attacker wins."
  },
  {
    "id": "archeotech_hunt",
    "attackerTactic": "point-blank_overwatch",
    "battle_length": "At the end of battle round 4, the attacker rolls a D6. The battle continues on a 3+, otherwise the battle ends. At the end of battle round 5, the attacker again rolls a D6. This time the battle continues on a 4+, otherwise the battle ends. The battle automatically ends at the end of battle round 6.",
    "defenderTactic": "point-blank_overwatch",
    "deployment": "Players deploy their kill teams as described in the Kill Team: Into the Fortress rules.",
    "description": "Valuable archeotech litters the Blackstone Fortress - relics on an ancient age, priceless unknown technology, or simply lost from previous owners slain by the inhabitants of this dark and unknowable realm.",
    "page": "100",
    "resources": "In a campaign game, the player who loses this mission loses 1 Materiel.",
    "scouting_phase": "Do not resolve the Scouting Phase in this mission.",
    "source": "White Dwarf June 2019",
    "specialRules": "At the end of each battle round, starting with the player with the initiative, players can alternate picking one objective marker that is within 3\" of any models from their kill team and rolling one D6. On a 5+, the archeotech has been found. Remove all of the other objective markers from the battlefield. Each objective marker can only be rolled for once per battle round. If the archeotech has not been found after all eligible objective markers have been rolled for at the end of battle round 4, continue alternating until the archeotech is found.",
    "specialRulesTitle": "The Archeotech",
    "the_battlefield": "Create the battlefield as described in the Kill Team: Into the Fortress rules.",
    "the_kill_teams": "This is a mission for two players. Choose which player will be the attacker and which will be the defender (roll off if you can't agree - the winner decides). Each player chooses a Faction keyword, and the players reveal their choices at the same time. Then each player chooses a Battle-forged kill team that only includes models with the Faction keyword they chose.",
    "title": "Archeotech Hunt",
    "type": "Open Play Mission",
    "uuid": "archeotech_hunt",
    "victory_conditions": "At the end of the battle, the player who controls the archeotech objective marker is the winner. If neither player controls the archeotech, the game is a draw."
  },
  {
    "id": "army_of_one",
    "alternative_mission": "If you are playing a campaign, you can choose to play this mission instead of the <a href=\"/missions/view/feint\">Feint</a> mission.",
    "attackerTactic": "apply_field_dressing",
    "battle_length": "Use the Variable Battle Length rules (Commanders, pg 19) - the defender rolls. In addition, if the attacker's Commander is out of action at the end of a battle round, or the attacker achieves their mission objective (see below), the battle ends.",
    "contributor": "DestructorNZ",
    "deployment": "The defender sets up all of their models first, followed by the attacker. A player's models must be set up wholly within their deployment zone. Once the players have set up all of their models, deployment ends and the first battle round begins. The attacker can choose which player has the initiative in the first battle round.",
    "description": "Whether they are the sole survivor of a crashed transport or they prefer to fight alone, unencumbered by the weight of leadership, a commander will sometimes perform a solo mission. Although they will inevitably be horribly outnumbered, commanders rarely reach such elevated positions by accident...",
    "page": "113",
    "requiresCommander": true,
    "resources": "In a campaign game, if the attacker wins the mission, the defender loses 1 Morale and 1 additional resource, depending on the mission objective: Escape - Territory; Slay the Leader - Intelligence; Destroy Munitions Cache - Materiel. If the defender wins the mission, the attacker loses 1 Intelligence.",
    "scouting_phase": "Do not use the rules for the Scouting phase in this mission.",
    "source": "Commanders Rulebook",
    "the_battlefield": "Create the battlefield and set up terrain. An example of how you might do this is shown below. The defender then places one objective marker in their deployment zone. The objective marker must be at least 6\" from the edge of the battlefield.",
    "the_kill_teams": "This is a mission for two players. Choose which player will be the attacker and which will be the defender (roll off if you can't agree - the winner decides). Each player chooses a Faction keyword, and the players reveal their choices at the same time. Then the defender chooses a Battle-forged kill team (see the Kill Team Core Manual) that only includes models with the Faction keyword they chose, and does not include a Commander. The attacker's kill team is a Commander with the Faction keyword they chose that does not cost more than 100 points (including their wargear and Commander Traits).",
    "title": "Army of One",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Farmy_of_one.png?alt=media&token=dec3b11b-bd54-4b3f-b4e3-674a0c101136",
    "type": "Narrative Play Mission",
    "uuid": "army_of_one",
    "victory_conditions": "At the start of the battle, the attacker secretly rolls a D6 ( either hide the dice for the duration of the battle or note down the result on a piece of paper), and consults the table below to discover their mission objective.\n<ul>\n<li><strong>1-2: Escape:</strong> Move your Commander off the edge of the battlefield labelled 'Escape Route' in the Movement phase. Your Commander can escape in this manner if their move is sufficient to take them wholly over the edge of the battlefield -they are not considered to be out of action.</li>\n\n<li><strong>3-4 Slay the Leader:</strong> Take the enemy Leader out of action.</li>\n\n<li><strong>5-6 Destroy Munitions Cache:</strong> Finish a battle round within 2\" of the objective marker.</li>\n</ul>\n\nAt the end of the battle, the attacker reveals their mission objective to the defender. If the attacker achieved their mission objective, the attacker wins. Otherwise, the defender wins."
  },
  {
    "id": "assassinate",
    "alternative_mission": "If you are playing a campaign, you can choose to play\n<a href=\"/missions/view/vital_sabotage\">Vital Sabotage</a> or <a href=\"/missions/view/crush_their_champions\">Crush Their Champions</a> instead.",
    "attackerTactic": "cut_off_the_head",
    "battle_length": "If the defender’s Leader is taken out of action, the\nbattle ends immediately. If not, at the end of battle\nround 4, the attacker rolls a D6. The battle continues\non a 3+, otherwise the battle ends. If the battle doesn’t\nend as described above, at the end of battle round\n5, the attacker again rolls a D6. This time the battle\ncontinues on a 4+, otherwise the battle ends. The battle\nautomatically ends at the end of battle round 6.",
    "defenderTactic": "staying_low",
    "deployment": "The players roll off, and then alternate setting up\nmodels, starting with the player who lost the roll-off.\nA player’s models must be set up wholly within their\ndeployment zone. In addition, the defender’s Leader\nmust be set up wholly within 5\" of the centre of the\ndefender’s deployment zone. If a player runs out of\nmodels to set up, skip them. Continue setting up models until both players have set up their kill teams. Once the\nplayers have set up all their models, deployment ends\nand the first battle round begins.",
    "description": "An army without its commanders is helpless, a beast ready for the slaughter. Kill teams are often\ndespatched with the intent of eliminating enemy leaders, thereby disrupting the war effort in that area so\nthat rapid gains can be made.",
    "page": "55",
    "resources": "In a campaign game (see page 202) if the attacker wins\nthe mission, the defender loses 1 Intelligence and 1\nMorale. If the defender wins the mission, the attacker\nloses 1 Morale.",
    "scouting_phase": "Resolve the Scouting phase as described on page 49.",
    "source": "Core Rulebook",
    "the_battlefield": "Create the battlefield and set up terrain. An example\nof how you might do this is shown below. The players\nroll off, and the player that wins chooses which of the\nshort edges of the battlefield their deployment zone\nis touching.",
    "the_kill_teams": "This is a mission for two players. Choose which player\nwill be the attacker and which will be the defender (roll\noff if you can’t agree – the winner decides). Each player\nchooses a Faction keyword, and the players reveal their\nchoices at the same time. Then each player chooses a\nBattle-forged kill team (see page 62) that only includes\nmodels with the Faction keyword they chose.",
    "title": "Assassinate",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fassassinat_map.png?alt=media&token=4022c792-5ff5-433f-b097-672a37824333",
    "type": "Narrative Play Mission",
    "uuid": "assassinate",
    "victory_conditions": "If the attacker takes the defender’s Leader out of action,\nthe attacker is the winner. Otherwise, the defender wins."
  },
  {
    "id": "authentication_protocols",
    "alternative_mission": "If you are playing a campaign, you can choose to play this mission instead of the <a href=\"/missions/view/disrupt_supply_lines\">Disrupt Supply Lines</a> mission.",
    "attackerTactic": "force_a_passage!",
    "battle_length": "Use the Variable Battle Length rules (Commanders, pg 19) - the defender rolls. In addition, if the attacker's Commander is out of action at the end of a battle round, or makes a successful breakthrough (see below), the battle ends.",
    "contributor": "DestructorNZ",
    "defenderTactic": "drive_them_back!",
    "deployment": "The players alternate setting up models, starting with the defender. If a player runs out of models to set up, skip them. Continue setting up models until both players have set up their kill team. A player's models must be set up wholly within their deployment zone. Once the players have set up all of their models, deployment ends and the first battle round begins.",
    "description": "Reliable intelligence or intercepted communications can be invaluable if used correctly. However, ensuring the veracity of such information is crucial before any military commitment can be made, and many warlords insist upon confirmation in person by a commander of sufficient rank whenever possible.",
    "page": "109",
    "requiresCommander": true,
    "resources": "In a campaign game, the losing player loses 1 Intelligence and the winner gains 1 Intelligence.",
    "scouting_phase": "Resolve the Scouting phase as described in the Kill Team Core Manual.",
    "source": "Commanders Rulebook",
    "specialRules": "The attacker can move their Commander off the edge of the battlefield labelled 'Breakthrough Route' in the Movement phase if their move is sufficient to take them wholly over the edge of the battlefield. If they do so their Commander is not considered to be out of action, but takes no further part in the mission.",
    "specialRulesTitle": "Breakthrough",
    "the_battlefield": "Create the battlefield and set up terrain. An example of how you might do this is shown below.",
    "the_kill_teams": "This is a mission for two players. Choose which player will be the attacker and which will be the defender (roll off if you can't agree - the winner decides). Each player chooses a Faction keyword, and the players reveal their choices at the same time. Then each player chooses a Battle-forged kill team (see the Kill Team Core Manual) that only includes models with the Faction keyword they chose. Each kill team can cost up to 200 points. The attacker must include one Commander in their kill team, and the defender cannot include a Commander.",
    "title": "Authentication Protocols",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fauthentication_protocols.png?alt=media&token=e56d0862-2852-4d36-9002-ae5f611138fb",
    "type": "Narrative Play Mission",
    "uuid": "authentication_protocols",
    "victory_conditions": "If, at the end of the battle, the attacker's Commander has made a successful breakthrough, the attacker wins. Otherwise, the defender wins."
  },
  {
    "id": "comms_down",
    "alternative_mission": "If you are playing a campaign, you can choose to play this mission instead of the <a href=\"/missions/view/recover_intelligence\">Recover Intelligence</a> mission.",
    "battle_length": "Use the Variable Battle Length rules (Commanders, pg 19) - the player with the greatest advantage (determined during deployment) rolls. In addition, if there is only one unbroken kill team on the battlefield at the end of a battle round, the battle ends.",
    "contributor": "DestructorNZ",
    "deployment": "Use the Standard Deployment rules (Commanders, pg 19).",
    "description": "Maintaining a reliable communications network can be crucial to the success of any campaign, and comms hubs subsequently form common battlegrounds between those attempting to deliver, intercept or prevent messages from getting through.",
    "four_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fcomms_down_4_player.png?alt=media&token=4fd97a30-8ab5-4a28-b812-217bf14ae256",
    "page": "115",
    "requiresCommander": true,
    "resources": "In a campaign game the player(s) that lose the mission each lose 2 Intelligence. If players draw they do not lose Intelligence.",
    "scouting_phase": "Resolve the Scouting phase as described in the Kill Team Core Manual.",
    "source": "Commanders Rulebook",
    "specialRules": " In this mission, each player whose Commander is within 2\" of the centre of the objective marker at the start of a battle round gains 1 additional Command Point.",
    "specialRulesTitle": "Orders Received",
    "the_battlefield": "Create the battlefield and set up terrain. Examples of how you might do this are shown below. Then set up one objective marker in the centre of the battlefield to represent a comms array.",
    "the_kill_teams": "This is a mission for two to four players. Each player chooses a Faction keyword, and the players reveal their choices at the same time. Then each player chooses a Battle-forged kill team (see the Kill Team Core Manual) that only includes models with the Faction keyword they chose. Each kill team can cost up to 200 points, and must include one Commander.",
    "title": "Comms Down",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fcomms_down_2_player.png?alt=media&token=95a54cd1-ff23-43b6-b1cb-e083a4f45f9f",
    "type": "Matched Play Mission",
    "uuid": "comms_down",
    "victory_conditions": "If the battle ends because there is only one unbroken kill team on the battlefield, that kill team's player wins. Otherwise, each player scores 1 victory point at the end of any battle round in which their Commander is within 2\" of the centre of the objective marker. The player with the most victory points is the winner. If players are tied for the most victory points, whichever of those players had the lower Force is the winner. If there is still a tie for the most victory points, the tied players draw. Any other players lose."
  },
  {
    "id": "crush_their_champions",
    "alternative_mission": "If you are playing a campaign, you can choose to play\nthis mission instead of the <a href=\"/missions/view/assassinate\">Assassinate</a> mission.",
    "battle_length": "Use the Variable Battle Length rules (pg 14) – the\nplayer with the greatest advantage (determined during\ndeployment) rolls.",
    "deployment": "Use the Standard Deployment rules (pg 14). Players\ncannot set up their Commanders in Reserve.",
    "description": "Sometimes the simplest solution to a problem is best. Your enemies have proved unbreakable, so with\na brazen challenge from your champion, you hope to draw their commanders out, risking your finest\nwarrior for an opportunity to destroy the morale of the opposing armies.",
    "four_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fcrush_their_champions_4_player_map.png?alt=media&token=03eb35f4-e099-4601-afe9-bbe38f80c888",
    "page": "141",
    "requiresCommander": true,
    "resources": "In a campaign game, the player(s) that lose the mission\neach lose 1 Intelligence and 1 Morale. If players draw\nthey do not lose Intelligence or Morale.",
    "scouting_phase": "Resolve the Scouting phase as described in the Kill Team\nCore Manual.",
    "source": "Elites Rulebook",
    "specialRules": "If a player’s Commander is out of action when they\ncheck to see if their kill team is broken in the Morale\nphase, their kill team is automatically broken. In\naddition, whenever a player’s Commander takes an\nenemy model out of action with an attack or psychic\npower, friendly models within 6\" of that Commander\nthat are shaken are no longer shaken.",
    "specialRulesTitle": "Crushing Blow",
    "the_battlefield": "Create the battlefield and set up terrain. Examples of\nhow you might do this are shown below.",
    "the_kill_teams": "This is a mission for two to four players. Each player\nchooses a Faction keyword, and the players reveal their\nchoices at the same time. Then each player chooses a\nBattle-forged kill team (see the Kill TeamCore Manual)\nthat only includes models with the Faction keyword\nthey chose. Each kill team can cost up to 200 points and\nmust include one Commander.",
    "title": "Crush Their Champions",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fcrush_their_champions_2_player_map.png?alt=media&token=d6e6f43a-3566-4c6c-b25e-8c8e1d60bbd2",
    "type": "Matched Play Mission",
    "uuid": "crush_their_champions",
    "victory_conditions": "If there is only one unbroken kill team on the battlefield\nat the end of the battle, that kill team’s player wins.\nOtherwise, each player scores 3 victory points for each\nenemy Commander taken out of action by an attack\nmade or psychic power manifested by a model from\ntheir kill team, and 1 victory point for each other enemy\nspecialist taken out of action by an attack made or\npsychic power manifested by a model from their kill\nteam. The player with the most victory points is the\nwinner. If players are tied for the most victory points,\nwhichever of those players had the lower Force is the\nwinner. If there is still a tie for the most victory points,\nthe tied players draw. Any other players lose."
  },
  {
    "id": "cut_off_the_head",
    "alternative_mission": "If you are playing a campaign, you can choose to play\nthis mission instead of the <a href=\"/missions/view/assassinate\">Assassinate</a>  mission.",
    "attackerTactic": "isolate_and_eliminate",
    "battle_length": "Use the Variable Battle Length rules (pg 19) -the\nattacker rolls. In addition, if the defender's Commander\nis out of action at the end of a battle round, the\nbattle ends.",
    "defenderTactic": "luck_favours_the_bold",
    "deployment": "The players alternate setting up models, starting with the\ndefender. If a player runs out of models to set up, skip\nthem. Continue setting up models until both players\nhave set up their kill team. A player's models must be\nset up wholly within their deployment zone. Once the\nplayers have set up all of their models, deployment ends\nand the first battle round begins.",
    "description": "Should an enemy commander be located, finding a way to eliminate them can strike a massive blow for\nthe ongoing war effort. Yet such important dignitaries are rarely found without a hardened bodyguard to\nprotect them, making any assassination attempt an incredibly risky venture.",
    "page": "108",
    "requiresCommander": true,
    "resources": "In a campaign game, if the attacker wins the mission,\nthe defender loses 1 Intelligence and 1 Morale. If the\ndefender wins the mission, the attacker loses 1 Morale.",
    "scouting_phase": "Resolve the Scouting phase as described in the Kill Team\nCore Manual.",
    "source": "Commanders Rulebook",
    "the_battlefield": "Create the battlefield and set up terrain. An example of\nhow you might do this is shown below.",
    "the_kill_teams": "This is a mission for two players. Choose which player\nwill be the attacker and which will be the defender (roll\noff if you can't agree - the winner decides). Each player\nchooses a Faction keyword, and the players reveal their\nchoices at the same time. Then each player chooses a\nBattle-forged kill team (see the Kill Team Core Manual)\nthat only includes models with the Faction keyword\nthey chose. Each kill team can cost up to 200 points.\nThe defender must include one Commander in their kill\nteam, and the attacker cannot include a Commander.",
    "title": "Cut Off The Head",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fcut_off_the_head.png?alt=media&token=abae8a8b-99c7-4a54-8fc7-b35b6325373a",
    "type": "Narrative Play Mission",
    "uuid": "cut_off_the_head",
    "victory_conditions": "If, at the end of the battle, the defender's Commander\nhas been taken out of action, the attacker wins.\nOtherwise, the defender wins."
  },
  {
    "id": "death_in_the_darkness",
    "battle_length": "At the end of battle round 4, the Adeptus Astartes player rolls a D6. The battle continues on a 3+, otherwise, the battle ends. If the battle doesn’t end as described above, at the end of battle round 5, the Adeptus Astartes player again rolls a D6. This time the battle continues on a 4+, otherwise, the battle ends. The battle automatically ends at the end of battle round 6.",
    "contributor": "JavaWarlord",
    "deployment": "The Adeptus Astartes player has the greatest strategic advantage. In a three- or four-player game, the remaining players each roll 2D6. The highest scorer has the greatest strategic advantage in this mission, the next highest gets the second greatest advantage and so on. Any players who roll the same result roll their dice again to determine which of them has a greater advantage. The players then take it in turn, in the order of greatest to least advantage, to choose their deployment zone. The players then take turns deploying one model from their kill team, in the order of least to greatest advantage. Models must be set up wholly within their own deployment zone. Once all players have set up one model, they do so again in the same order, and so on. If a player runs out of models to set up, skip them. Once the players have set up all their models, deployment ends and the first battle round begins.",
    "description": "Experts in covert warfare are never more at home than when engaging an unprepared foe, and an assault at night all but guarantee an advantage to the attacking force.",
    "four_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2FIMG_8246.JPG?alt=media&token=5d738267-1907-4da6-ae4f-428b0a648846",
    "page": "Card",
    "resources": "In a campaign game the player(s) that lose the mission each lose 1 Morale and 1 Territory. If players draw they do not lose Morale or Territory.",
    "scouting_phase": "Resolve the Scouting phase (see the Core Manual).",
    "source": "Fangs of Ulfrich Boxed Set",
    "specialRules": "Models cannot target models that are more than 12\" away, or affect them with psychic powers.",
    "specialRulesTitle": "In the Dead of Night",
    "the_battlefield": "Create the battlefield and set up terrain. Examples of this are show below. Set up one objective marker in the center of the battlefield.",
    "the_kill_teams": "This is a mission for two to four players. One of those players is the Adeptus Astartes player. If more than one player wishes to be the Adeptus Astartes player, those players roll off and the winner is the Adeptus Astartes player. Each player chooses a Faction keyword, and the players reveal their choices at the same time. The Adeptus Astartes player must choose the <b>Adeptus Astartes</b> Faction. Then each player chooses a Battle-forged kill team (see the Core Manual) that only includes models with the Faction keyword they chose.",
    "title": "Death In The Darkness",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2FIMG_8245.JPG?alt=media&token=610bdc2e-dd07-4416-91a1-6ccfb7df2125",
    "type": "Matched Play Mission",
    "uuid": "death_in_the_darkness",
    "victory_conditions": "Each player scores 1 victory point for each enemy model taken out of action by one of their model’s attacks or psychic powers, and the player that controls the objective marker at the end of the battle scores 3 victory points. The player with the most victory points is the winner. If there is a tie, those players draw. Any other players lose."
  },
  {
    "id": "deep_strike",
    "battle_length": "The battle ends at the end of battle\nround 5.",
    "deployment": "The defender sets up their kill\nteam anywhere wholly within 6\"\nof the centre of the battlefield. The\nattacker must set up all of their\nmodels in Reserve.",
    "description": "A key defensive emplacement must be taken before the army can advance. High command authorises a\ndangerous strike directly onto the target, the better to overwhelm the defenders.",
    "page": "134",
    "scouting_phase": "Do not use the rules for the\nScouting phase in this mission.",
    "source": "Elites Rulebook",
    "specialRules": "When an attacker’s model is\nset up from Reserve, it can be\nset up within 1\" of the edge of\nthe battlefield and more than 5\"\naway from any enemy models.\nIn addition, if the attacker’s kill\nteam is Battle-forged they gain an\nadditional 1CP at the start of each\nbattle round.",
    "specialRulesTitle": " Priority Target",
    "the_battlefield": "Create the battlefield and set\nup terrain.",
    "the_kill_teams": "This is a mission for two players.\nChoose which player will be the\nattacker and which will be the\ndefender (roll off if you can’t agree\n– the winner decides). Each player\nchooses a kill team.",
    "title": "Deep Strike",
    "type": "Open Play Mission",
    "uuid": "deep_strike",
    "victory_conditions": "If, at the end of the battle, the\ndefender’s models are all shaken\nor out of action, the attacker wins.\nOtherwise, the defender wins."
  },
  {
    "id": "disrupt_supply_lines",
    "alternative_mission": "If you are playing a campaign, you can choose to\nplay <a href=\"/missions/view/escalating_conflict\">Escalating Conflict</a> instead.",
    "attackerTactic": "disrupt_supply_line",
    "battle_length": "At the end of battle round 4, the attacker rolls a D6. The\nbattle continues on a 3+, otherwise the battle ends. At\nthe end of battle round 5, the attacker again rolls a D6.\nThis time the battle continues on a 4+, otherwise the\nbattle ends. The battle automatically ends at the end of\nbattle round 6.",
    "defenderTactic": "protect_the_assets",
    "deployment": "The players roll off, and then alternate setting up\nmodels, starting with the player who lost the roll-off.\nA player’s models must be set up wholly within their\ndeployment zone. If a player runs out of models to set\nup, skip them. Continue setting up models until both\nplayers have set up their kill teams. Once the players\nhave set up all their models, deployment ends and the\nfirst battle round begins.",
    "description": "The success or failure of an army depends on how well it is supplied, and kill teams play a vital part in\nboth sabotaging and safeguarding supply lines. When high command receives intelligence that a supply\nline is in danger, they will quickly dispatch a kill team to intercept and eliminate the saboteurs.",
    "page": "52",
    "resources": "In a campaign game (see page 202) if the attacker\nwins the mission, the defender loses 2 Materiel. If the\ndefender wins the mission, the attacker loses 1 Morale.",
    "scouting_phase": "Resolve the Scouting phase as described on page 49.",
    "source": "Core rulebook",
    "the_battlefield": "Create the battlefield and set up terrain. An example\nof how you might do this is shown below. The players\nroll off, and the player that wins chooses which of the\nshort edges of the battlefield their deployment zone\nis touching. The defender then places three objective\nmarkers in their territory. Each objective marker must\nbe at least 6\" from other objective markers and the edge\nof the battlefield.",
    "the_kill_teams": "This is a mission for two players. Choose which player\nwill be the attacker and which will be the defender (roll\noff if you can’t agree – the winner decides). Each player\nchooses a Faction keyword, and the players reveal their\nchoices at the same time. Then each player chooses a\nBattle-forged kill team (see page 62) that only includes\nmodels with the Faction keyword they chose.",
    "title": "Disrupt Supply Lines",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fdisrupt_supply_lines_map.png?alt=media&token=c79ace9a-8bf4-4d64-ac28-b51f1d3991c3",
    "type": "Narrative Play Mission",
    "uuid": "disrupt_supply_lines",
    "victory_conditions": "At the end of the battle, each objective marker is worth 3\nvictory points to the player who controls it. In addition,\nthe attacker scores 1 victory point for each objective\nmarker they have destroyed, and a player scores 1\nvictory point if the enemy player’s kill team is broken.\nThe player with the most victory points is the winner. If\nthe players have the same number of victory points, the\ndefender wins."
  },
  {
    "id": "duel_of_honour",
    "alternative_mission": "If you are playing a campaign, you can choose to play this mission instead of the <a href=\"/missions/view/assassinate\">Assassinate</a> mission.",
    "attackerTactic": "trophy_kill",
    "battle_length": "Use the Variable Battle Length rules (Commanders, pg 19) - the player with the initiative in that battle round rolls. In addition, if there is only one unbroken kill team on the battlefield at the end of a battle round, the battle ends.",
    "contributor": "DestructorNZ",
    "defenderTactic": "trophy_kill",
    "deployment": "The players set up their Commanders ½\" apart in the centre of the battlefield, on the side that is nearest their edge of the battlefield (see the example below), and then the first battle round begins. At the end of their turn to move in the Movement phase of the first battle round, each player sets up the remaining models from their kill team wholly within 6\" of their edge of the battlefield.",
    "description": "Almost every form of human and alien life possesses its own warrior culture. As such, it is not unusual to find two enemy commanders advancing out in front of their lines to engage in personal combat, their honour guards either unwilling or forbidden to interrupt until one stands and the other falls.",
    "page": "112",
    "requiresCommander": true,
    "resources": "In a campaign game, the losing player loses 1 Morale. The winner gains 1 Morale if they are a Victor, but otherwise does not lose or gain Morale. Players that draw do not lose or gain Morale.",
    "scouting_phase": "Do not use the rules for the Scouting phase in this mission.",
    "source": "Commanders Rulebook",
    "specialRules": "Neither Commander can Fall Back in the first battle round. Players cannot target or charge the enemy Commander with any models from their kill team other than their own Commander (for example, a PSYKER that is not a Commander cannot manifest the Psybolt psychic power if it would target the enemy Commander), unless their Commander is out of action. If the enemy Commander was taken out of action by an attack made or psychic power manifested by a player's Commander, that player is the Victor, and can use the Trophy Kill Tactic (see below) from that point on, as long as their Commander is not shaken or out of action.",
    "specialRulesTitle": "Honour Duel",
    "the_battlefield": "Create the battlefield and set up terrain. An example of how you might do this is shown below. The players roll off, and the player that wins chooses which of the short edges of the battlefield will be theirs.",
    "the_kill_teams": "This is a mission for two players. Each player chooses a Faction keyword, and the players reveal their choices at the same time. Then each player chooses a Battle-forged kill team (see the Kill Team Core Manual) that only includes models with the Faction keyword they chose. Each kill team can cost up to 200 points, and must include one Commander.",
    "title": "Duel of Honour",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fduel_of_honour.png?alt=media&token=44dd486c-a865-49b3-bcb5-00301fa30b98",
    "type": "Narrative Play Mission",
    "uuid": "duel_of_honour",
    "victory_conditions": "If, at the end of the battle, a player's Commander has been taken out of action, their opponent scores 3 victory points, or 5 victory points if that Commander was taken out of action by a Commander. Each player scores 1 victory point for each other enemy model taken out of action. The player with the most victory points is the winner. If there is a tie, the Victor ( see below) is the winner. If there is a tie and there is no Victor, the result is a draw."
  },
  {
    "id": "escalating_conflict",
    "alternative_mission": "If you are playing a campaign, you can choose to\nplay this mission instead of the <a href=\"/missions/view/disrupt_supply_lines\">Disrupt Supply\nLines</a> mission.",
    "battle_length": "Use the Variable Battle Length rules (pg 14) – the\nplayer with the greatest advantage (determined during\ndeployment) rolls. In addition, if there is only one\nunbroken kill team on the battlefield at the end of a\nbattle round, the battle ends.",
    "deployment": "Each player must divide their kill team into two parts,\none of which is approximately half the points value of\nthe other. Players then use the Standard Deployment\nrules (pg 14) to set up the smaller parts of their kill\nteams. All other models are automatically set up\nin Reserve",
    "description": "Your scouts have made contact with the enemy, and are calling in support – they are either pinned in\nplace or have identified an objective that you cannot afford falling into enemy hands. Dispatch your finest\nwarriors as quickly as you can to recover your operatives and deny victory to your enemies.",
    "four_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fescalating_conflict_4_player_map.png?alt=media&token=8a7c14e7-115a-4305-8f6a-aa62d4ad4911",
    "page": "140",
    "resources": "In a campaign game, the player(s) that lose the mission\neach lose 1 Intelligence and 1 Materiel. If players draw\nthey do not lose Intelligence or Materiel.",
    "scouting_phase": "Resolve the Scouting phase as described in the Kill Team\nCore Manual.",
    "source": "Elites Rulebook",
    "specialRules": "Models that are within 2\" of the centre of the objective\nmarker automatically pass Nerve tests.",
    "specialRulesTitle": "Vital Objective",
    "the_battlefield": "Create the battlefield and set up terrain. Examples of\nhow you might do this are shown below. Then set up\none objective marker in the centre of the battlefield.",
    "the_kill_teams": "This is a mission for two to four players. Each player\nchooses a Faction keyword, and the players reveal their\nchoices at the same time. Then each player chooses a\nBattle-forged kill team (see the Kill TeamCore Manual)\nthat only includes models with the Faction keyword\nthey chose. Each kill team can cost up to 125 points",
    "title": "Escalating Conflict",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fescalating_conflict_2_player_map.png?alt=media&token=f85a6043-46a3-4b45-be59-59ba05ff9183",
    "type": "Matched Play Mission",
    "uuid": "escalating_conflict",
    "victory_conditions": "If the battle ends because there is only one unbroken\nkill team on the battlefield, that kill team’s player wins.\nOtherwise, if one player controls the objective at the end\nof the battle, that player wins. If no player controls the\nobjective, the player with the greatest Force (in points)\non the battlefield (not including shaken models) is the\nwinner. If players are tied for the greatest force, the tied\nplayers draw. Any other players lose."
  },
  {
    "id": "escape_the_facility",
    "alternative_mission": "If you are playing a campaign, you can choose to play\nthis mission instead of the <a href=\"/missions/view/feint\">Feint</a> mission.",
    "attackerTactic": "break_free",
    "battle_length": "Use the Variable Battle Length rules (pg 14) – the\ndefender rolls. In addition, if at the end of a battle round\nall of the attacker’s models have escaped (see above)\nand/or are out of action, the battle ends.",
    "deployment": "The attacker sets up all of their models wholly within\ntheir deployment zone (they cannot set up any models\nin Reserve). Then the defender sets up their models\nanywhere on the battlefield that is more than 8\" from\nany of the attacker’s models. Each of the defender’s\nmodels must also be more than 4\" from any of the\ndefender’s other models. Once the players have set up\nall of their models, deployment ends and the first battle\nround begins.",
    "description": "To their great shame, some elite warriors were captured. However, through ingenuity, opportunism\nor simple brute force, they have escaped, and must now fight their way out of the facility and its\nsurroundings to freedom.",
    "page": "139",
    "resources": "In a campaign game, if the attacker wins the mission,\nthe defender loses 1 Intelligence and 1 Morale. If the\ndefender wins the mission, the attacker loses 1 Morale.",
    "scouting_phase": "Do not use the rules for the Scouting phase in\nthis mission.",
    "source": "Elites Rulebook",
    "specialRules": "In the first battle round, the defender’s models on the\nbattlefield cannot move (for any reason) or React. In\naddition, if at the beginning of the defender’s turn in the\nMovement phase there are no attacker’s models within\n9\" of a defender’s model on the battlefield, that model\ncannot move (for any reason) or make any shooting\nattacks in that battle round. Commanders are not\naffected by this rule.",
    "specialRules2": "The attacker can move any of their models off the\nbattlefield edge labelled ‘Escape route’ if that model’s\nmove is sufficient to take them wholly over the edge of\nthe battlefield. A model that leaves the battlefield this\nway is not considered to be out of action, but takes no\nfurther part in the mission.",
    "specialRules2Title": "Escape",
    "specialRulesTitle": "Sentries",
    "the_battlefield": "Create the battlefield and set up terrain. An example of\nhow you might do this is shown below.",
    "the_kill_teams": "This is a mission for two players. Choose which player\nwill be the attacker and which will be the defender\n(roll off if you can’t agree – the winner decides). Each\nplayer chooses a Faction keyword, and the players\nreveal their choices at the same time. Then each player\nchooses a Battle-forged kill team (see the Kill TeamCore\nManual) that only includes models with the Faction\nkeyword they chose. Each kill team can cost up to 200\npoints. Each player may include a Commander in their\nkill team.",
    "title": "Escape The Facility",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fescape-the-facility.png?alt=media&token=fc3a239d-dfe0-4397-bfaf-9914a2950023",
    "type": "Narrative Play Mission",
    "uuid": "escape_the_facility",
    "victory_conditions": "If, at the end of the battle, more of the attacker’s models\nhave escaped than are on the battlefield or have been\ntaken out of action, the attacker wins. Otherwise, the\ndefender wins."
  },
  {
    "id": "exemplars_of_war",
    "alternative_mission": "If you are playing a campaign, you can choose to play this mission instead of the <a href-\"/missions/view/assassinate\">Assassinate</a> or <a href=\"sweep_and_clear\">Sweep and Clear</a> missions.",
    "battle_length": "Use the Variable Battle Length rules (Commanders, pg 19) - the player with the greatest advantage (determined during deployment) rolls. In addition, if there is only one unbroken kill team on the battlefield at the end of a battle round, the battle ends.",
    "contributor": "DestructorNZ",
    "deployment": "Use the Standard Deployment rules (Commanders, pg 19).",
    "description": "Whether a Genestealer Patriarch or a Captain of the Adeptus Astartes, a commander has earned their place as a champion of their kind, and may be called on not only to lead from the front but to strike down their foes in personal combat to inspire those that follow them into battle.",
    "four_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fexemplars_of_war_4_player.png?alt=media&token=757b24bd-c890-4250-acd3-a4ba749e054e",
    "page": "117",
    "requiresCommander": true,
    "resources": "In a campaign game the player(s) that lose the mission each lose 1 Morale and the player that wins the mission gains 1 Morale. If players draw they do not lose or gain Morale.",
    "scouting_phase": "Resolve the Scouting phase as described in the Kill Team Core Manual.",
    "source": "Commanders Rulebook",
    "specialRules": "In this mission, if a player's Commander takes an enemy Commander out of action with one of their attacks or psychic powers, that player can use all of their Commander's Aura Tactics (if they have any) in the next battle round at no cost in Command Points.",
    "specialRulesTitle": "A Glorious Deed",
    "the_battlefield": "Create the battlefield and set up terrain. Examples of how you might do this are shown below.",
    "the_kill_teams": "This is a mission for two to four players. Each player chooses a Faction keyword, and the players reveal their choices at the same time. Then each player chooses a Battle-forged kill team (see the Kill Team Core Manual) that only includes models with the Faction keyword they chose. Each kill team can cost up to 200 points, and must include one Commander.",
    "title": "Exemplars of War",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fexemplars_of_war_2_player.png?alt=media&token=23a12ede-be69-4300-bc4c-a6ffd5a2173e",
    "type": "Matched Play Mission",
    "uuid": "exemplars_of_war",
    "victory_conditions": "If the battle ends because there is only one unbroken kill team on the battlefield, that kill team's player wins. Otherwise, each player scores 3 victory points for each enemy Commander taken out of action by an attack made or psychic power manifested by their Commander, 2 victory points for each other enemy specialist taken out of action by an attack made or psychic power manifested by their Commander, and 1 victory point for each other enemy model taken out of action by an attack made or psychic power manifested by their Commander. The player with the most victory points is the winner. If players are tied for the most victory points, whichever of those players had the lower Force is the winner. If there is still a tie for the most victory points, the tied players draw. Any other players lose."
  },
  {
    "id": "extraction",
    "alternative_mission": "If you are playing a campaign, you can choose to play this mission instead of the <a href=\"/missions/view/feint\">Feint</a> mission.",
    "attackerTactic": "through_gritted_teeth",
    "battle_length": "Use the Variable Battle Length rules (Commanders, pg 19) - the attacker rolls. In addition, if the attacker's Commander is out of action at the end of a battle round, the battle ends.",
    "contributor": "DestructorNZ",
    "deployment": "The players alternate setting up models, starting with the attacker. If a player runs out of models to set up, skip them. Continue setting up models until both players have set up their kill team. A player's models must be set up wholly within their deployment zone. Once the players have set up all of their models, deployment ends and the first battle round begins. The attacker can choose which player has the initiative in the first battle round.",
    "description": "If a commander is wounded in battle, it is imperative that a rescue attempt be made before they are finished off, or worse, spirited away and subjected to interrogation, for the knowledge they hold cannot be allowed to fall into the hands of the enemy.",
    "page": "111",
    "requiresCommander": true,
    "resources": "In a campaign game, if the attacker wins the mission, the defender loses 2 Intelligence. If the defender wins the mission, the attacker loses 1 Intelligence and 1 Morale.",
    "scouting_phase": "Do not use the rules for the Scouting phase in this mission.",
    "source": "Commanders Rulebook",
    "specialRules": "The Commander is badly wounded, so starts the game with one flesh wound and their Move, Attacks, Leadership, Wounds and Strength characteristics are reduced by 1 for the duration of the battle. In addition, the Commander cannot Advance or make charge moves during the battle.",
    "specialRulesTitle": "Walking Wounded",
    "the_battlefield": "Create the battlefield and set up terrain. An example of how you might do this is shown below. The attacker then sets up their Commander as close as possible to the centre of the battlefield.",
    "the_kill_teams": "This is a mission for two players. Choose which player will be the attacker and which will be the defender (roll off if you can't agree - the winner decides). Each player chooses a Faction keyword, and the players reveal their choices at the same time. Then each player chooses a Battle-forged kill team (see the Kill Team Core Manual) that only includes models with the Faction keyword they chose. Each kill team can cost up to 200 points. The attacker must choose one Commander, but this model is free (they do not need to pay points to include them in their kill team).",
    "title": "Extraction",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fextraction.png?alt=media&token=870d2df2-d72b-49de-918b-3e9db8d31654",
    "type": "Narrative Play Mission",
    "uuid": "extraction",
    "victory_conditions": "If, at the end of the battle, the attacker's Commander has been taken out of action, the defender wins. Otherwise, the attacker wins."
  },
  {
    "id": "extreme_measures",
    "alternative_mission": "If you are playing a campaign, you can choose to play this mission instead of the <a href=\"/missions/view/fient\">Feint</a> mission.",
    "attackerTactic": "set_charges",
    "battle_length": "At the end of battle round 4, the attacker rolls a D6. The battle continues on a 3+, otherwise the battle ends. At the end of battle round 5, the attacker rolls a D6. This time the battle continues on a 4+, otherwise the battle ends. The battle automatically ends at the end of battle round 6.",
    "contributor": "DestructorNZ",
    "defenderTactic": "defuse_charges",
    "deployment": "The players roll off, and then alternate setting up models, starting with the player who lost the roll-off. A player's models must be set up wholly within their deployment zone. If a player runs out of models to set up, skip them. Continue setting up models until both players have set up their kill teams. Once the players have set up all their models, deployment ends and the first battle round begins.",
    "description": "Word has spread of an arsenal of weapons deep in enemy territory. Without a full-scale invasion of a heavily defended area, there's no way to capture it, so instead it must be destroyed. A kill team may be able to infiltrate, locate the arsenal and set charges to destroy it, seriously damaging their enemy. They might even survive.",
    "page": "1",
    "resources": "In a campaign game, if the attacker wins the mission, the defender loses I Materiel and 1 Morale. If the defender wins the mission, the attacker loses 1 Morale.",
    "scouting_phase": "Resolve the Scouting phase as described in the Core Manual.",
    "source": "Sector Munitorum",
    "the_battlefield": "This mission is played in a Killzone: Sector Munitorum. Create the battlefield and set up terrain. The players roll off, and then they take it in turn, starting with the highest scorer, to set up an objective marker until there are six objective markers on the battlefield. Each objective marker must be at least 4\" from other objective markers and 6\" from the edge of the board. The players then roll off again, and the player that wins chooses a corner of the battlefield for their deployment zone - their opponent's deployment zone is in the opposite corner.",
    "the_kill_teams": "This is a mission for two players. Choose which player will be the attacker and which will be the defender (roll off if you can't agree - the winner decides). Each player chooses a Faction keyword, and the players reveal their choices at the same time. Then each player chooses a Battle-forged kill team (see the Core Manual) that only includes models with the Faction keyword they chose.",
    "title": "Extreme Measures",
    "type": "Narrative Play Mission",
    "uuid": "extreme_measures",
    "victory_conditions": "At the end of the battle, if there are more marked objectives (see 'Set Charges' below) than there are unmarked objectives, the attacker wins. Otherwise, the defender wins."
  },
  {
    "id": "face-off",
    "battle_length": "The battle lasts until one player's\nCommander is taken out of action.",
    "deployment": "The player that won the earlier\nroll-off sets up their Commander\nanywhere wholly within 3\" of\nthe battlefield edge they chose.\nTheir opponent then sets up\ntheir Commander anywhere\nwholly within 3\" of the opposite\nbattlefield edge.",
    "description": "In the middle of a raging battle, two commanders find themselves alone in the eye of the storm. With\nweapons loaded and blades drawn, they are both ready to face their moment of destiny.",
    "page": "107",
    "requiresCommander": true,
    "scouting_phase": "Do not use the rules for the\nScouting phase in this mission.",
    "source": "Commanders Rulebook",
    "the_battlefield": "Create the battlefield and set up\nterrain. The players roll off, with\nthe winner picking one table edge\nto be their starting position.",
    "the_kill_teams": "This is a mission for two players.\nEach player chooses a kill team\nconsisting of one Commander.",
    "title": "Face-Off",
    "type": "Open Play Mission",
    "uuid": "face-off",
    "victory_conditions": "The player that took their\nopponent's Commander out of\naction wins."
  },
  {
    "id": "feint",
    "alternative_mission": "If you are playing a campaign, you can choose to play\n<a href=\"/missions/view/escape_the_facility\">Escape The Facility</a> instead.",
    "attackerTactic": "cause_mayhem",
    "battle_length": "At the end of battle round 4, the attacker rolls a D6. The\nbattle continues on a 3+, otherwise the battle ends. At\nthe end of battle round 5, the attacker again rolls a D6.\nThis time the battle continues on a 4+, otherwise the\nbattle ends. The battle automatically ends at the end of\nbattle round 6.",
    "defenderTactic": "reinforcements_inbound",
    "deployment": "The players roll off, and then alternate setting up\nmodels, starting with the player who lost the roll-off.\nA player’s models must be set up wholly within their\ndeployment zone. If a player runs out of models to set\nup, skip them. Continue setting up models until both\nplayers have set up their kill teams. Once the players\nhave set up all their models, deployment ends and the\nfirst battle round begins.",
    "description": "By staging a suitably loud, brutal and spectacular attack, a kill team can cause enough disruption and\nmayhem to make a commander believe they face a much larger force. As they hurriedly reassign troops to\nwhere they believe they are needed, the real attack strikes at their most vulnerable spot.",
    "page": "54",
    "resources": "In a campaign game (see page 202) if the attacker\nwins the mission, the defender loses 1 Materiel and 1\nTerritory. If the defender wins the mission, the attacker\nloses 1 Territory.",
    "scouting_phase": "Resolve the Scouting phase as described on page 49.",
    "source": "Core Rulebook",
    "the_battlefield": "Create the battlefield and set up terrain. An example\nof how you might do this is shown below. The players\nroll off, and the player that wins chooses which of the\nshort edges of the battlefield their deployment zone\nis touching. Starting with the defender, the players\nthen take it in turn to place an objective marker until\neach player has placed three objective markers. Each\nobjective marker must be more than 5\" from other\nobjective markers and more than 5\" from the edge of the\nbattlefield.",
    "the_kill_teams": "This is a mission for two players. Choose which player\nwill be the attacker and which will be the defender (roll\noff if you can’t agree – the winner decides). Each player\nchooses a Faction keyword, and the players reveal their\nchoices at the same time. Then each player chooses a\nBattle-forged kill team (see page 62) that only includes\nmodels with the Faction keyword they chose.",
    "title": "Feint",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Ffeint_map.png?alt=media&token=f4e88d6f-2e48-4c73-b84f-a959d246c090",
    "type": "Narrative Play Mission",
    "uuid": "feint",
    "victory_conditions": "At the end of the battle, the defender scores 2 victory\npoints for each objective marker that is still on the\nbattlefield (see the Cause Mayhem Tactic below). The\nattacker scores 1 victory point for each objective marker\nthey have destroyed. In addition, the attacker scores\n1 victory point if the enemy kill team is broken, and\n1 victory point for each enemy specialist that is out of\naction at the end of the battle. The player with the most\nvictory points is the winner. If the players have the same\nnumber of victory points, the defender wins."
  },
  {
    "id": "fire_at_will",
    "alternative_mission": "If you are playing a campaign, you can choose to play this mission instead of the <a href=\"/missions/view/ambush\">Ambush</a> or <a href=\"/missions/view/recover_intelligence\">Recover Intelligence</a> missions.",
    "battle_length": "The battle ends at the end of a battle round if there is only one unbroken kill team on the battlefield. Otherwise, at the end of battle round 4, the player with the greatest advantage rolls a D6. On a 3+, the game continues, otherwise the game is over. If the battle doesn't end as described above, at the end of battle round 5, the player with the greatest advantage rolls a D6. This time the game continues on a 4+, otherwise the game is over. The battle automatically ends at the end of battle round 6.",
    "contributor": "DestructorNZ",
    "deployment": "The players each roll 2D6. The highest scorer has the greatest strategic advantage in this mission, the next highest gets the second greatest advantage and so on. Any players who roll the same result roll their dice again to determine which of them has a greater advantage. The players then take it in turn, ln the order of greatest to least advantage, to choose their deployment zone.<br /><br />\n\nThe players then take it in turn to deploy one model from their kill team, in the order ofleast to greatest advantage. Models must be set up wholly within their own deployment zone. Once all players have set up one model, they do so again in the same order, and so on. If a player runs out of models to set up, skip them. Once the players have set up all their models, deployment ends and the first battle round begins.",
    "description": "A kill team has stumbled upon a rich prize - a store of weapons, ammunition and supplies that will be a great asset to their faction. However, they are not the only ones to locate this stash, and the only way to establish their claim is to destroy their rivals. The close confines and the hazardous environment mean that it will be a lucky fighter that emerges unscathed.",
    "page": "2",
    "resources": "In a campaign game, the player(s) that lose the mission each lose 1 Territory, while the player that wins gains 1 Materiel. If players draw they do not lose or gain resources.",
    "scouting_phase": "Resolve the Scouting phase as described in the Core Manual.",
    "source": "Sector Munitorum",
    "specialRules": "Each time you roll an unmodified hit roll of 1 when making a shooting attack (other than Overwatch), if the target of the attack is within 1\" of a terrain feature, they suffer 1 mortal wound.",
    "specialRulesTitle": "Unexploded Munitions",
    "the_battlefield": "This mission is played in a Killzone: Sector Munitorum. Create the battlefield and set up terrain. Examples of how you might do this are shown below.",
    "the_kill_teams": "This is a mission for two to four players. Each player chooses a Fachon keyword, and the players reveal their choices at the same time. Then each player chooses a Battle-forged kill team (see the Core Manual) that only includes models with the Faction keyword they chose.",
    "title": "Fire at Will",
    "type": "Matched Play Mission",
    "uuid": "fire_at_will",
    "victory_conditions": "If the battle ends because there is only one unbroken kill team on the battlefield, that kill team's player wins. Otherwise, each player scores 1 victory point for each enemy model taken out of action by one of their models' attacks or psychic powers. The player with the most victory points is the winner. If players are tied for the most victory points, those players draw. Any other players lose."
  },
  {
    "id": "heroic_stand",
    "battle_length": "The battle ends at the end of battle\nround 5.",
    "deployment": "The defender first sets up their\nentire kill team anywhere wholly\nwithin 5\" of the centre of the\nbattlefield. The attacker then sets\nup their entire kill team anywhere\non the battlefield that is more than\n8\" from the defender's models.",
    "description": "Surrounded on all sides by the enemy, a valiant commander chooses to stand their ground to buy time\nfor their kill team to escape.",
    "page": "107",
    "requiresCommander": true,
    "scouting_phase": "Do not use the rules for the\nScouting phase in this mission.",
    "source": "Commanders Rulebook",
    "the_battlefield": "Create the battlefield and set\nup terrain.",
    "the_kill_teams": "This is a mission for two players.\nChoose which player will be the\nattacker and which will be the\ndefender (roll off if you can't agree\n-the winner decides). Each player\n. chooses a kill team. The defender\ncan include one Commander,\nwhilst we recommend that the\nattacker does not.",
    "title": "Heroic Stand",
    "type": "Open Play Mission",
    "uuid": "heroic_stand",
    "victory_conditions": "The defender can move any of\ntheir models, other than their\nCommander, off any battlefield\nedge if that model's move is\nsufficient to take them wholly\nover the edge of the battlefield. A\nmodel that leaves the battlefield\nthis way is not considered to be\nout of action, but takes no further\npart in the mission.<br /><br />\nIf the defender manages to move\nat least half of the models in\ntheir kill team (excluding their\nCommander) off the battlefield\nbefore their Commander is taken\nout of action, the defender wins.\nOtherwise the attacker wins."
  },
  {
    "id": "hold_the_line",
    "alternative_mission": "If you are playing a campaign, you can choose to play this mission instead of the <a href=\"/missions/view/recover_intelligence\">Recover Intelligence</a> mission.",
    "battle_length": "Use the Variable Battle Length rules (Commanders, pg 19) - the player with the greatest advantage (determined during deployment) rolls. In addition, if there is only one unbroken kill team on the battlefield at the end of a battle round, the battle ends.",
    "contributor": "DestructorNZ",
    "deployment": "Use the Standard Deployment rules (Commanders, pg 19).",
    "description": "Such is the august position that a commander holds that their presence alone can often be enough to turn the tide of a battle. They are commonly deployed, or bravely volunteer, to lead the defence of crucial sectors to ensure that the enemy does not breach their lines.",
    "four_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fhold_the_line_4_player.png?alt=media&token=e3b2b65b-6312-4e6c-b6da-e82fead34ff9",
    "page": "116",
    "requiresCommander": true,
    "resources": "In a campaign game the player(s) that lose the mission each lose 2 Territory. If players draw they do not lose Territory.",
    "scouting_phase": "Resolve the Scouting phase as described in the Kill Team Core Manual.",
    "source": "Commanders Rulebook",
    "the_battlefield": "Create the battlefield and set up terrain. Examples of how you might do this are shown below. Then set up four objective markers by dividing the battlefield into quarters and placing an objective as close as possible to the centre of each quarter, as shown in the deployment maps below.",
    "the_kill_teams": "This is a mission for two to four players. Each player chooses a Faction keyword, and the players reveal their choices at the same time. Then each player chooses a Battle-forged kill team (see the Kill Team Core Manual) that only includes models with the Faction keyword they chose. Each kill team can cost up to 200 points, and must include one Commander.",
    "title": "Hold the Line",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fhold_the_line_2_player.png?alt=media&token=f284a99d-a9a5-4988-ac19-c683fdf1f9f2",
    "type": "Matched Play Mission",
    "uuid": "hold_the_line",
    "victory_conditions": "If the battle ends because there is only one unbroken kill team on the battlefield, that kill team's player wins. Otherwise, each player scores 1 victory point for each objective marker that their kill team controls at the end of the battle and 1 victory point for each enemy Commander that was taken out of action by one of their models' attacks or psychic powers. The player with the most victory points is the winner. If players are tied for the most victory points, whichever of those players had the lower Force is the winner. If there is still a tie for the most victory points, the tied players draw. Any other players lose."
  },
  {
    "id": "lines_of_battle",
    "battle_length": "At the end of battle round 4, the\nattacker rolls a D6. The battle\ncontinues on a 3+, otherwise the\nbattle ends. At the end of battle\nround 5, the attacker again rolls a\nD6. This time the battle continues\non a 4+, otherwise the battle ends.\nThe battle automatically ends at\nthe end of battle round 6.",
    "deployment": "The defender sets up their kill\nteam anywhere within 6\" of the\nbattlefield edge they must hold.\nThe attacker then sets up their kill\nteam anywhere within 6\" of the\nopposite battlefield edge.",
    "description": "Sometimes it is up to a single unit to try to hold a flank and stop the enemy from breaking through to\ntheir defenceless support and supply trains. If they fail, the war is almost certainly lost!",
    "page": "51",
    "scouting_phase": "Resolve the Scouting phase as\ndescribed on page 49.",
    "source": "Core rulebook",
    "the_battlefield": "Create the battlefield and set up\nterrain. The defender then picks\none battlefield edge to be the line\nthey must hold.",
    "the_kill_teams": "This is a mission for two players.\nChoose which player will be the\nattacker and which will be the\ndefender (roll off if you can’t agree\n– the winner decides). Each player\nchooses a kill team (see page 62).",
    "title": "Lines of Battle",
    "type": "Open Play Mission",
    "uuid": "lines_of_battle",
    "victory_conditions": "The attacker can move their\nmodels off the defender’s\nbattlefield edge, if that model’s\nmove is sufficient to take it wholly\nover the edge of the battlefield.\nA model that does so has broken\nthrough – it is not out of action,\nbut takes no further part in the\nmission. At the end of the battle,\nthe attacker scores 1 victory point\nfor each model that has broken\nthrough, while the defender\nscores 1 victory point for each\nof the attacker’s models that has\nnot broken through. The player\nwith the most victory points is\nthe winner. If the players have the\nsame number of victory points,\nthe defender wins."
  },
  {
    "id": "none_shall_pass",
    "battle_length": "The battle ends at the end of battle\nround 5.",
    "deployment": "The defender sets up their kill\nteam anywhere wholly within 6\" of\nthe battlefield edge they must hold.\nThe attacker then sets up their kill\nteam anywhere wholly within 6\" of\nthe opposite battlefield edge.",
    "description": "A commander leads an elite band of specialist warriors to guard a route into the heart of a city against\nthe vanguard of an impossibly large enemy host.",
    "page": "106",
    "requiresCommander": true,
    "scouting_phase": "Do not use the rules for the\nScouting phase in this mission.",
    "source": "Commanders Rulebook",
    "the_battlefield": "Create the battlefield and set up\nterrain. The defender then picks\none battlefield edge to be the line\nthey must hold.",
    "the_kill_teams": "This is a mission for two players.\nChoose which player will be the\nattacker and which will be the\ndefender (roll off if you can't agree\n- the winner decides). Each player\nchooses a kill team. The defender\ncan include one Commander,\nand all oftheir other models can\nbe specialists if you wish. We\nrecommend that the attacker's only\nspecialist be a Leader, but their kill\nteam should heavily outnumber\nthe defender's kill team.",
    "title": "None Shall Pass",
    "type": "Open Play Mission",
    "uuid": "none_shall_pass",
    "victory_conditions": "The attacker can move any of\ntheir models off the defender's\nbattlefield edge if that model's\nmove is sufficient to take them\nwholly over the edge of the\nbattlefield. A model that does so\nhas broken through - it is not\nconsidered to be out of action,\nbut takes no further part in the\nmission. At the end of the battle,\nthe attacker scores 1 victory point\nfor each model that has broken\nthrough, while the defender scores\n1 victory point for each of the\nattacker's models that was taken\nout of action. The player with the\nmost victory points is the winner.\nIfthe players have the,same\nnumber of victory points, the\ndefender wins."
  },
  {
    "id": "objective_ultima",
    "alternative_mission": "If you are playing a campaign, you can choose to play\nthis mission instead of the <a href=\"/missions/view/recover_intelligence\">Recover Intelligence</a> mission.",
    "battle_length": "Use the Variable Battle Length rules (pg 14) – the\nplayer with the greatest advantage (determined during\ndeployment) rolls.",
    "deployment": "Use the Standard Deployment rules (pg 14).",
    "description": "A crucial piece of archeotech has become the site of an ongoing battle, as each of the opposing sides\nstruggles to seize it for themselves. As control shifts one way and then the other, it becomes clear that to\nconsolidate their claim, a force also needs to take the surrounding control nodes.",
    "four_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fobjective_ultima_4_player_map.png?alt=media&token=884fabff-0772-4043-a9a1-f857c7143d12",
    "page": "142",
    "resources": "In a campaign game, the player(s) that lose the mission\neach lose 1 Intelligence and 1 Territory. If players draw\nthey do not lose Intelligence or Territory.",
    "scouting_phase": "Resolve the Scouting phase as described in the Kill Team\nCore Manual.",
    "source": "Elites Rulebook",
    "the_battlefield": "Create the battlefield and set up terrain. Examples\nof how you might do this are shown below. Then\nset up an objective in the centre of the battlefield\n(this is the primary objective), and four other\nobjectives each halfway between the centre of the\nbattlefield and a corner of the battlefield (these are the\nsecondary objectives).",
    "the_kill_teams": "This is a mission for two to four players. Each player\nchooses a Faction keyword, and the players reveal their\nchoices at the same time. Then each player chooses a\nBattle-forged kill team (see the Kill TeamCore Manual)\nthat only includes models with the Faction keyword\nthey chose. Each kill team can cost up to 125 points.",
    "title": "Objective Ultima",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fobjective_ultima_2_player_map.png?alt=media&token=4278e17e-2a45-4634-8755-e6fa583755e3",
    "type": "Matched Play Mission",
    "uuid": "objective_ultima",
    "victory_conditions": "If a player controls the primary objective and at least\none secondary objective at the end of a battle round,\nthey gain a number of victory points equal to the\nnumber of secondary objectives they control. The player\nwith the most victory points at the end of the battle\nis the winner. If players are tied for the most victory\npoints, whichever of those players controls the primary\nobjective at the end of the battle is the winner. If none of\nthe tied players controls the primary objective, the tied\nplayers draw. Any other players lose."
  },
  {
    "id": "rampage",
    "alternative_mission": "If you are playing a campaign, you can choose to play\nthis mission instead of the <a href=\"/missions/view/ambush\">Ambush</a> mission.",
    "attackerTactic": "gory_spectacle",
    "battle_length": "Use the Variable Battle Length rules (pg 14) – the\nattacker rolls. In addition, if at the end of a battle round\nall of the defender’s models are shaken or out of action,\nor the attacker’s Rampage count is 10 or more (see\nbelow), the battle ends.",
    "deployment": "The players alternate setting up models, starting with\nthe defender. The defender cannot set up any models\nin Reserve. If a player runs out of models to set up, skip\nthem. Continue setting up models until both players\nhave set up their kill team. A player’s models must be\nset up wholly within their deployment zone. Once the\nplayers have set up all of their models, deployment ends\nand the first battle round begins.",
    "description": "A group of dyed-in-the-wool killers have broken through enemy lines, and are now set to wreak havoc\nthrough the unsuspecting reserves. They must make their attack count – if they rampage for too long, they\nare sure to be cut off and eliminated.",
    "page": "138",
    "resources": "In a campaign game, if the attacker wins the mission,\nthe defender loses 1 Materiel and 1 Morale. If the\ndefender wins the mission, the attacker loses 1 Morale.",
    "scouting_phase": "Resolve the Scouting phase as described in the Kill Team\nCore Manual.",
    "source": "Elites Rulebook",
    "specialRules": "See below table",
    "specialRulesTitle": "Rampage Count",
    "special_rule_image": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Frampage_table.png?alt=media&token=99ea6605-4557-4093-a358-c908a7393080",
    "the_battlefield": "Create the battlefield and set up terrain. An example of\nhow you might do this is shown below.",
    "the_kill_teams": "This is a mission for two players. Choose which player\nwill be the attacker and which will be the defender (roll\noff if you can’t agree – the winner decides). Each player\nchooses a Faction keyword, and the players reveal their\nchoices at the same time. Then each player chooses a\nBattle-forged kill team (see the Kill TeamCore Manual)\nthat only includes models with the Faction keyword\nthey chose. Each kill team can cost up to 125 points. The\nattacker may include a Commander in their kill team,\nand the defender may not include a Commander in\ntheir kill team.",
    "title": "Rampage",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Frampage.png?alt=media&token=08814be5-9209-460f-9559-df98f03a74af",
    "type": "Narrative Play Mission",
    "uuid": "rampage",
    "victory_conditions": "If the battle ends because all of the defender’s models\nare shaken or out of action, or because the attacker’s\nRampage count is 10 or more, the attacker wins.\nOtherwise, the attacker scores a number of victory\npoints equal to their Rampage count. The defender\nscores 2 victory points for each attacker’s model that is\nout of action. The player with the most victory points is\nthe winner. If there is a tie, the defender wins."
  },
  {
    "id": "reclamation_raid",
    "alternative_mission": "If you are playing a campaign, you can choose to play this mission instead of the <a href=\"/missions/view/disrupt_supply_lines\">Disrupt Supply Lines</a> mission.",
    "battle_length": "Use the Variable Battle Length rules (Commanders, pg 19) - the player with the greatest advantage (determined during deployment) rolls. In addition, if there is only one unbroken kill team on the battlefield at the end of a battle round, the battle ends.",
    "contributor": "DestructorNZ",
    "deployment": "Use the Standard Deployment rules (Commanders, pg 19).",
    "description": "Many races possess unique, ancient, or highly esoteric technology. Should examples of such archeotech be lost in battle and at risk of falling into the hands of their enemies, a commander will waste no time in leading a sortie to recover it.",
    "four_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Freclamation_raid_4_player.png?alt=media&token=669dcabe-1fc2-41fd-96ae-dfb802489fc3",
    "page": "118",
    "requiresCommander": true,
    "resources": "In a campaign game the player(s) that lose the mission each lose 1 Materiel, and the player that wins gains 1 Materiel. If players draw they do not lose or gain Materiel.",
    "scouting_phase": "Resolve the Scouting phase as described in the Kill Team Core Manual.",
    "source": "Commanders Rulebook",
    "specialRules": "In this mission, subtract 1 from Nerve tests made for models that are within 2\" of the centre of an objective marker.",
    "specialRulesTitle": "Priceless Archeotech",
    "the_battlefield": "Create the battlefield and set up terrain. Examples of how you might do this are shown below. Set up one objective marker in the centre of the battlefield, and then set up four more; each should be midway between the centre of the battlefield and a corner of the battlefield, as shown in the deployment maps below.",
    "the_kill_teams": "This is a mission for two to four players. Each player chooses a Faction keyword, and the players reveal their choices at the same time. Then each player chooses a Battle-forged kill team (see the Kill Team Core Manual) that only includes models with the Faction keyword they chose. Each kill team can cost up to 200 points, and must include one Commander.",
    "title": "Reclamation Raid",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Freclamation_raid_2_player.png?alt=media&token=2f6e9c59-e043-4d8d-82b6-eb955421358e",
    "type": "Matched Play Mission",
    "uuid": "reclamation_raid",
    "victory_conditions": "If the battle ends because there is only one unbroken kill team on the battlefield, that kill team's player wins. Otherwise, each player scores 1 victory point for each objective marker that their kill team controls at the end of the battle. The player with the most victory points is the winner. If players are tied for the most victory points, whichever of those players had the lower Force is the winner. If there is still a tie for the most victory points, the tied players draw. Any other players lose."
  },
  {
    "id": "recover_intelligence",
    "alternative_mission": "If you are playing a campaign, you can choose to play\n<a href=\"missions/view/objective_ultima\">Objective Ultima</a> instead",
    "battle_length": "At the end of battle round 4, the player with the greatest\nadvantage rolls a D6. The battle continues on a 3+,\notherwise the battle ends. At the end of battle round 5,\nthe player with the greatest advantage again rolls a D6.\nThis time the battle continues on a 4+, otherwise the\nbattle ends. The battle automatically ends at the end of\nbattle round 6.",
    "deployment": "The players each roll 2D6. The highest scorer has the\ngreatest strategic advantage in this mission, the next\nhighest gets the second greatest advantage and so on.\nAny players who roll the same result roll their dice again\nto determine which of them has a greater advantage.\nThe players then take it in turn, in the order of greatest\nto least advantage, to choose their deployment zone.\nThe players then take it in turn to deploy one model\nfrom their kill team, in the order of least to greatest\nadvantage. Models must be set up wholly in their own\ndeployment zone. Once all players have set up one\nmodel, they do so again in the same order, and so on. If a player runs out of models to set up, skip them. Once\nthe players have set up all their models, deployment\nends and the first battle round begins.",
    "description": "Strategic intelligence is a weapon more deadly than any amount of plasma warheads or bolt rifles. It often\nfalls to fast-moving, hard-hitting kill teams to seize the data-augurs, orbital uplinks and the like that\ncontain such data and swiftly exload it so that their commanders can outmanoeuvre the enemy.",
    "four_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Frecover_intelligence_4_player_map.png?alt=media&token=a8e30583-45c4-4ec9-8a0c-adeff6e4bd45",
    "page": "58",
    "resources": "In a campaign game (see page 202) the player(s) that\nlose the mission each lose 2 Intelligence. If players draw\nthey do not lose Intelligence.",
    "scouting_phase": "Resolve the Scouting phase as described on page 49.",
    "source": "Core Rulebook",
    "the_battlefield": "Create the battlefield and set up terrain. Examples\nof how you might do this are shown below. Set up\none objective marker in the centre of the battlefield,\nand then set four more up; each should be midway\nbetween the centre of the battlefield and a corner of the\nbattlefield, as shown on the deployment maps below.",
    "the_kill_teams": "This is a mission for two to four players. Each player\nchooses a Faction keyword, and the players reveal their\nchoices at the same time. Then each player chooses a\nBattle-forged kill team (see page 62) that only includes\nmodels with the Faction keyword they chose.",
    "title": "Recover Intelligence",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Frecover_intelligence_2_player_map.png?alt=media&token=d5a82df9-71b9-419a-9363-f60706d3b7d7",
    "type": "Matched Play Mission",
    "uuid": "recover_intelligence",
    "victory_conditions": "Each player scores victory points for each objective\nmarker their kill team controls at the end of each battle\nround (keep a score from battle round to battle round).\nEach player scores 1 victory point for controlling each of\nthe objective markers closest to their deployment zone,\n3 victory points if they control the objective marker\nin the centre of the battlefield, and 2 victory points for\neach other objective marker they control. The player\nwith the most victory points is the winner. If there is\na tie, whichever of those players had the lower Force\n(see page 19) is the winner. If there is still a tie, the tied\nplayers draw and any other players lose."
  },
  {
    "id": "search_and_rescue",
    "battle_length": "The battle ends at the end of battle round 5.",
    "deployment": "The rescuer picks a battlefield half to be their deployment zone and sets up a model anywhere in that deployment zone, more than 8\" from the enemy deployment zone.\nPlayers then alternate setting up models in this way. If one player finishes deploying first, the other player may continue to set up models until all members of both kill teams are set up.",
    "description": "When a key operative is lost behind enemy lines, the rest of their unit must retrace their steps and locate their missing comrade before the enemy does.",
    "page": "51",
    "scouting_phase": "Resolve the Scouting phase as described on page 49.",
    "source": "Core Rulebook",
    "the_battlefield": "Create the battlefield and set up terrain. The defender places 5 objective markers anywhere on the battlefield. Each objective marker must be at least 4\" from other objective markers and the edge of the battlefield. They then divide the battlefield into even halves.",
    "the_kill_teams": "This is a mission for two players. Choose which player will be the rescuer and which will be the defender (roll off if you can’t agree – the winner decides). Each player chooses a kill team (see page 62).",
    "title": "Search and Rescue",
    "type": "Open Play Mission",
    "uuid": "search_and_rescue",
    "victory_conditions": "At the end of the Movement phase, roll a D6 in turn for each objective marker within 1\" of any of your models and more than 1\" from any enemy models (if both players can do so, take it in turn following the order determined in the Initiative phase). On a 6, immediately\nremove all the other markers from the battlefield, including any yet to be rolled for. From this point onwards, do not make any further rolls for objectives. \n\nAt the end of the battle, whichever player has the most models within 2\" of the remaining objective marker is the\nwinner. \n\nIf neither player has more models within 2\" of the objective marker than their opponent, or if all of the objective markers are still on the battlefield, the rescuer wins."
  },
  {
    "id": "sector_munitorum_3",
    "alternative_mission": "If you are playing a campaign, you can choose to play this mission instead of the <a href=\"/missions/view/assassinate\">Assassinate</a> or <a href=\"/missions/view/sweep_and_clear\">Sweep and Clear</a> missions.",
    "battle_length": "At the end of battle round 4, the player with the greatest advantage rolls a D6. The battle continues on a 3+, otherwise the battle ends. If the battle doesn't end as described above, at the end of battle round 5, the player with the greatest advantage rolls a D6. This time the battle continues on a 4+, otherwise the battle ends. The battle automatically ends at the end of battle round 6.",
    "contributor": "DestructorNZ",
    "deployment": "The players each roll 2D6. The highest scorer has the greatest strategic advantage in this mission, the next highest gets the second greatest advantage and so on. Any players who roll the same result roll their dice again to determine which of them has a greater advantage. The players then take it in turn, in the order of greatest to least advantage, to choose their deployment zone.<br /><br />\n\nThe players then take it in turn to deploy one model from their kill team, in the order ofleast to greatest advantage. Models must be set up wholly within their own deployment zone. Once all players have set up one model, they do so again in the same order, and so on. If a player runs out of models to set up, skip them. Once the players have set up all their models, deployment ends and the first battle round begins.",
    "description": "A faction has crumbled and its rivals now descend to plunder its holdings, like carrion flocking to a fresh kill. Warehouses are a prime target, though whether they actually contain spoils worth the risk of encountering competitors cannot be foreseen.",
    "page": "3",
    "resources": "In a campaign game, the player(s) that lose the mission each lose 1 lntelligence and 1 Morale. If players draw they do not lose or gain resources.",
    "scouting_phase": "Resolve the Scouting phase as described in the Core Manual.",
    "source": "Sector Munitorum",
    "specialRules": "If a player controls an objective marker at the end of a battle round, and it has not been identified, they roll a D6 and consult the following table. The objective marker has then been identified.\n\n<ul>\n<li><strong>1</strong> - Nothing of Value: Remove the objective marker.</li>\n<li><strong>2-3</strong> - Curio: Remove the objective maker and gain 1 victory point.</li>\n<li><strong>4-5</strong> - Supplies: If a player controls this objective marker at the end of the battle, they gain 2 victory points.</li>\n<li><strong>6</strong> - Vital Resource: If a player controls this objective marker at the end of the battle, they gain 3 victory points.</li>",
    "specialRulesTitle": "Scavenge Supplies",
    "the_battlefield": "This mission is played in a Killzone: Sector Munitorum. Create the battlefield and set up terrain. Examples of how you might do this are shown below. Then set up four objective markers midway between the centre of the battlefield and each corner of the battlefield, and one objective marker in the centre of the battlefield, as shown in the deployment maps below.",
    "the_kill_teams": "This is a mission for two to four players. Each player chooses a Faction keyword, and the players reveal their choices at the same time. Then each player choose a Battle-forged kill team (see the Core Manual) that only includes models with the Faction keyword they chose.",
    "title": "Sector Munitorum 3",
    "type": "Matched Play Mission",
    "uuid": "sector_munitorum_3",
    "victory_conditions": "The player with the most victory points is the winner. If players are tied for the most victory points, those players draw. Any other players lose."
  },
  {
    "id": "shifting_priorities",
    "alternative_mission": "If you are playing a campaign, you can choose to play\nthis mission instead of the <a href=\"/missions/view/terror_tactics\">Terror Tactics</a> mission.",
    "battle_length": "Use the Variable Battle Length rules (pg 14) – the\nplayer with the greatest advantage (determined during\ndeployment) rolls.",
    "deployment": "Use the Standard Deployment rules (pg 14). Models\nmust be set up at least 4\" from enemy deployment zones.",
    "description": "In the confusion of battle, orders may be garbled or misinterpreted, leaders in the field may prioritise the\nwrong objective, and fighters can become disoriented. Amidst this maelstrom, a commander with a cool\nhead and the ability to adapt their battle plan on the fly is likely to claim victory.",
    "four_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fshifting_priorities_4_player_map.png?alt=media&token=05bbd590-d8dc-4a53-aa20-b639d05dfd7e",
    "page": "143",
    "resources": "In a campaign game, the player(s) that lose the mission\neach lose 1 Materiel and 1 Territory. If players draw they\ndo not lose Materiel or Territory.",
    "scouting_phase": "Resolve the Scouting phase as described in the Kill Team\nCore Manual.",
    "source": "Elites Rulebook",
    "specialRules": "The player with the greatest advantage (determined\nduring deployment) rolls a D6 at the beginning of each\nbattle round, and consults the following table.\n\nSee table below",
    "specialRulesTitle": "Priority One",
    "special_rule_image": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fshifting_priorities_table.png?alt=media&token=b7551114-0bd4-4d75-8605-3cea56a0a11c",
    "the_battlefield": "Create the battlefield and set up terrain. Examples of\nhow you might do this are shown below. Then set up\nfour objectives each halfway between the centre of the\nbattlefield and a battlefield edge, numbered from 1-4.",
    "the_kill_teams": "This is a mission for two to four players. Each player\nchooses a Faction keyword, and the players reveal their\nchoices at the same time. Then each player chooses a\nBattle-forged kill team (see the Kill TeamCore Manual)\nthat only includes models with the Faction keyword\nthey chose. Each kill team can cost up to 200 points and\nmay include a Commander.",
    "title": "Shifting Priorities",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fshifting_priorities_2_player_map.png?alt=media&token=7d5563f9-a0c1-49e4-8dac-ae516c3c52e8",
    "type": "Matched Play Mission",
    "uuid": "shifting_priorities",
    "victory_conditions": "Each player scores 1 victory point at the end of each\nbattle round for each objective they control. The player\nwith the most victory points at the end of the battle\nis the winner. If players are tied for the most victory\npoints, whichever of those players had the lower Force\nis the winner. If there is still a tie for the most victory\npoints, the tied players draw. Any other players lose."
  },
  {
    "id": "stowaway",
    "alternative_mission": "If you are playing a campaign, you can choose to play this mission instead of the <a href=\"/mission/view/disrupt_supply_lines>Disrupt Supply Lines</a> mission.",
    "attackerTactic": "create_distraction",
    "battle_length": "At the end of battle round 4, the attacker rolls a D6. The battle continues on a 3+, otherwise the battle ends. At the end of battle round 5, the attacker rolls a D6. This time the battle continues on a 4+, otherwise the battle ends. The battle automatically ends at the end of battle round 6.",
    "contributor": "DestructorNZ",
    "defenderTactic": "rouse_yourselves",
    "deployment": "The defender sets up their models, anywhere that is more than 5\" from the attacker's deployment zone. The attacker then sets up their models, wholly within their deployment zone. Once the players have set up their models, deployment ends and the first battle round begins.",
    "description": "Intelligence indicates an opening in a powerful foe's defences - an automated shipment could provide an easy route behind their lines and afford a small but daring group of warriors a chance to wreak untold damage before escaping. All that they have to do is infiltrate the distribution hub and stow away without causing so much alarm that they are discovered.",
    "page": "4",
    "resources": "In a campaign game if the attacker wins the mission, the defender loses 2 Morale. If the defender wins the mission, the defender gains 1 Materiel.",
    "scouting_phase": "Do not use the rules for the Scouting phase in this mission.",
    "source": "Sector Munitorum",
    "specialRules": "ln the first battle round, the defender's models cannot move or React.",
    "specialRules2": "The attacker's models can stowaway in the Munitorum Armoured Containers. To do so, they must begin the battle round within 1\" horizontally and 4\" vertically of that Munitorum Armoured Container, and can do nothing else in that battle round. If, at the end of the battle round, they are not shaken and there is no enemy model within 4\" (except shaken models) they can stowaway- remove them from the battlefield. They are not considered to be out of action, but otherwise play no further part in the mission. Only one model can stowaway in each Munitorum Armoured Container.",
    "specialRules2Title": "Stowaways",
    "specialRulesTitle": "Sentries",
    "the_battlefield": "This mission is played in a Killzone: Sector Munitorum. Create the battlefield and then the defender sets up terrain, which must include at least six Munitorum Armoured Containers. An example of how you might do this is shown below. The attacker then chooses which of the short edges of the battlefield their deployment zone is touching.",
    "the_kill_teams": "This is a mission for two players. Choose which player will be the attacker and which will be the defender (roll off if you can't agree - the winner decides). Each player chooses a Faction keyword, and the players reveal their choices at the same time. Then each player chooses a Battle-forged kill team (see the Core Manual) that only includes models with the Faction keyword they chose.",
    "title": "Stowaway",
    "type": "Narrative Play Mission",
    "uuid": "stowaway",
    "victory_conditions": "At the end of the battle, the attacker scores 1 victory point for each of their models that successfully stowed away, and the defender scores 1 victory point for each of the attacker's models that is shaken or out of action. The player with the most victory points is the winner. If the players have the same number of victory points, the defender wins."
  },
  {
    "id": "surrounded",
    "alternative_mission": "If you are playing a campaign, you can choose to play\nthis mission instead of the <a href=\"/missions/view/ambush\">Ambush</a> mission.",
    "attackerTactic": "finish_them",
    "battle_length": "Use the Variable Battle Length rules (pg 14) – the\nattacker rolls.",
    "defenderTactic": "vengeful_reinforcements",
    "deployment": "The defender sets up all of the models in one part of\ntheir kill team wholly within their deployment zone\n(they cannot set up any of these models in Reserve).\nTheir remaining models are set up in Reserve. Then the\nattacker sets up one of their models wholly within one\nof their deployment zones, then another model wholly\nwithin their other deployment zone, and continues to\nalternate like this until all of their models have been\nset up. Once the players have set up all of their models,\ndeployment ends and the first battle round begins.",
    "description": "Even the most experienced warriors can find themselves outmanoeuvred and surrounded.\nWhen this happens, there’s little they can do other than hope that they are able to hold out until\nreinforcements arrive.",
    "page": "137",
    "resources": "In a campaign game, if the attacker wins the mission,\nthe defender loses 1 Morale and 1 Territory. If the\ndefender wins the mission, the attacker loses 1 Materiel.",
    "scouting_phase": "Do not use the rules for the Scouting phase in\nthis mission.",
    "source": "Elites Rulebook",
    "specialRules": "The defender’s models cannot be set up from Reserve\nin the first battle round. When a defender’s model is\nset up from Reserve, it can be set up within 1\" of the\nedge of the battlefield and more than 5\" away from any\nenemy models.",
    "specialRulesTitle": "Awaiting Reinforcements",
    "the_battlefield": "Create the battlefield and set up terrain. An example of\nhow you might do this is shown below.",
    "the_kill_teams": "This is a mission for two players. Choose which player\nwill be the attacker and which will be the defender (roll\noff if you can’t agree – the winner decides). Each player\nchooses a Faction keyword, and the players reveal their\nchoices at the same time. Then each player chooses a\nBattle-forged kill team (see the Kill TeamCore Manual)\nthat only includes models with the Faction keyword\nthey chose. Each kill team can cost up to 125 points. The\ndefender then splits their kill team into two parts, with\nat least one model in each part.",
    "title": "Surrounded",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fsurrounded.png?alt=media&token=04ffe0b3-3ffa-42f6-a279-3bf45ca2479f",
    "type": "Narrative Play Mission",
    "uuid": "surrounded",
    "victory_conditions": "If, at the end of the battle, all of the defender’s models\nare out of action, shaken or in Reserve, the attacker\nwins. Otherwise, the defender wins."
  },
  {
    "id": "sweep_and_clear",
    "battle_length": "The battle ends at the end of a battle round if there\nis only one unbroken kill team on the battlefield.\nOtherwise, at the end of battle round 4, the player with\nthe greatest advantage rolls a D6. The battle continues\non a 3+, otherwise the battle ends. If the battle doesn’t\nend as described above, at the end of battle round 5, the\nplayer with the greatest advantage again rolls a D6. This\ntime the battle continues on a 4+, otherwise the battle\nends. The battle automatically ends at the end of battle\nround 6.",
    "deployment": "The players each roll 2D6. The highest scorer has the\ngreatest strategic advantage in this mission, the next\nhighest gets the second greatest advantage and so on.\nAny players who roll the same result roll their dice again\nto determine which of them has a greater advantage.\nThe players then take it in turn, in the order of greatest\nto least advantage, to choose their deployment zone.\nThe players then take it in turn to deploy one model\nfrom their kill team, in the order of least to greatest\nadvantage. Models must be set up wholly within their\nown deployment zone. Once all players have set up one\nmodel, they do so again in the same order, and so on. If\na player runs out of models to set up, skip them. Once\nthe players have set up all their models, deployment\nends and the first battle round begins.",
    "description": "When securing territory, it is imperative that all enemy forces are driven out of it, lest lurking saboteurs\nstrike at supposedly safe locations. Kill teams are often employed in this task, sweeping contested areas\nquickly and stealthily to eliminate any threats that might still be active in the area.",
    "four_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fsweep_and_clear_4_player_map.png?alt=media&token=d64ef5f6-ed2e-4c26-833f-a058b931ecb9",
    "page": "56",
    "resources": "In a campaign game (see page 202) the player(s) that\nlose the mission each lose 2 Territory. If players draw\nthey do not lose Territory.",
    "scouting_phase": "Resolve the Scouting phase as described on page 49.",
    "source": "Core Rulebook",
    "the_battlefield": "Create the battlefield and set up terrain. Examples of\nhow you might do this are shown below. Then set up\nfour objective markers midway between the centre of\nthe battlefield and the middle of a battlefield edge, as\nshown in the deployment maps below.",
    "the_kill_teams": "This is a mission for two to four players. Each player\nchooses a Faction keyword, and the players reveal their\nchoices at the same time. Then each player chooses a\nBattle-forged kill team (see page 62) that only includes\nmodels with the Faction keyword they chose.",
    "title": "Sweep and Clear",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fsweep_and_clear_2_player_map.png?alt=media&token=d42e0d67-657f-4bca-9585-44f988045a3f",
    "type": "Matched Play Mission",
    "uuid": "sweep_and_clear",
    "victory_conditions": "If the battle ends because there is only one unbroken\nkill team on the battlefield, that kill team’s player wins.\nOtherwise, each player scores 3 victory points for each\nobjective marker that their kill team controls at the end of\nthe battle and 1 victory point for each enemy model taken\nout of action by one of their model’s attacks or psychic\npowers. The player with the most victory points is the\nwinner. If there is a tie, whichever of those players had the\nlower Force (see page 19) is the winner. If there is still a\ntie, the tied players draw and any other players lose."
  },
  {
    "id": "take_prisoners",
    "battle_length": "At the end of battle round 4, the player with the greatest\nadvantage rolls a D6. The battle continues on a 3+,\notherwise the battle ends. At the end of battle round 5,\nthe player with the greatest advantage again rolls a D6.\nThis time the battle continues on a 4+, otherwise the\nbattle ends. The battle automatically ends at the end of\nbattle round 6.",
    "deployment": "The players each roll 2D6. The highest scorer has the\ngreatest strategic advantage in this mission, the next\nhighest gets the second greatest advantage and so on.\nAny players who roll the same result roll their dice again\nto determine which of them has a greater advantage.\nThe players then take it in turn, in the order of greatest\nto least advantage, to choose their deployment zone.\nThe players then take it in turn to deploy one model\nfrom their kill team, in the order of least to greatest\nadvantage. Models must be set up wholly within their\nown deployment zone. Once all players have set up one\nmodel, they do so again in the same order, and so on. If\na player runs out of models to set up, skip them. Once\nthe players have set up all their models, deployment\nends and the first battle round begins.",
    "description": "Kill team operatives are often privy to sensitive information such as the locations of high-ranking\npersonnel, hidden supply caches and secret routes through defensive lines. Rival kill teams may thus seek\nto seize their enemies alive, so that this vital intelligence can be extracted from them.",
    "four_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Ftake_prisoners_4_player_map.png?alt=media&token=4473e319-5110-4a9b-b771-3654bdb33c57",
    "page": "57",
    "resources": "In a campaign game (see page 202) the player(s) that\nlose the mission each lose 1 Materiel and 1 Morale. If\nplayers draw they do not lose any resources.",
    "scouting_phase": "Resolve the Scouting phase as described on page 49.",
    "source": "Core Rulebook",
    "specialRules": "An enemy model is captured by your kill team if it\nis taken out of action for whatever reason whilst it is\nwithin 1\" of a model from your kill team (excluding\nshaken models) and there are no other enemy models\n(excluding shaken models) within 2\" of your model.\nEnemy models that go out of action after the battle ends\nin a campaign game do not count. The enemy model is\nstill considered to be out of action, and in a campaign\ngame the model’s player will make a Casualty roll for\nthem as normal.",
    "specialRulesTitle": "Captured",
    "the_battlefield": "Create the battlefield and set up terrain. Examples of\nhow you might do this are shown below.",
    "the_kill_teams": "This is a mission for two to four players. Each player\nchooses a Faction keyword, and the players reveal their\nchoices at the same time. Then each player chooses a\nBattle-forged kill team (see page 62) that only includes\nmodels with the Faction keyword they chose.",
    "title": "Take Prisoners",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Ftake_prisoners_2_player_map.png?alt=media&token=e99805a2-acbf-4bea-8d53-57b1f81f37af",
    "type": "Matched Play Mission",
    "uuid": "take_prisoners",
    "victory_conditions": "Each player scores 3 victory points for each enemy\nLeader that their kill team has captured (see below) and\n1 victory point for each other enemy model that their\nkill team has captured. The player with the most victory\npoints is the winner. If there is a tie, whichever of those\nplayers had the lower Force (see page 19) is the winner.\nIf there is still a tie, the tied players draw and any other\nplayers lose."
  },
  {
    "id": "territorial_imperative",
    "attackerTactic": "point-blank_overwatch",
    "battle_length": "At the end of battle round 4, the attacker rolls a D6. The battle continues on a 3+, otherwise the battle ends. At the end of battle round 5, the attacker again rolls a D6. This time the battle continues on a 4+, otherwise the battle ends. The battle automatically ends at the end of battle round 6.",
    "defenderTactic": "point-blank_overwatch",
    "deployment": "Players deploy their kill teams as described in the Kill Team: Into the Fortress rules.",
    "description": "The first step in controlling any territory is to hold the key points and drive out any opposing forces. Whilst this is never a simple task aboard a Blackstone Fortress, it certainly isn't impossible.",
    "page": "100",
    "resources": "In a campaign game, the player who loses this missions loses 1 Materiel.",
    "scouting_phase": "Do not resolve the Scouting Phase in this mission",
    "source": "White Dwarf",
    "the_battlefield": "Create the battlefield as described in the Kill Team: Into the Fortress rules",
    "the_kill_teams": "This is a mission for two players. Choose which player will be the attacker and which will be the defender (roll off it you can't agree - the winner decides). Each player chooses a Faction keyword, and the players reveal their choices at the same time. Then each player chooses a Battle-forged kill team that only includes models with the Faction keyword they chose.",
    "title": "Territorial Imperative",
    "type": "Open Play Mission",
    "uuid": "territorial_imperative",
    "victory_conditions": "At the end of the battle, each player scores 2 victory points for each objective marker they control. <br /><br />\nPlayers can also score additional points for fulfilling the following conditions:\n<ul>\n<li>Score 1 victory point if the enemy kill team is broken at the end of the battle</li>\n<li>Score 2 victory points if they enemy kill team's Leader is out of action at the end of the battle.</li>\n<li>Score 1 victory point for each Specialist from the enemy kill team that is out of action at the end of the battle.\n</ul>\nThe player with the most victory points is the winner. If both players have the same score, the game is a draw."
  },
  {
    "id": "terror_tactics",
    "alternative_mission": "If you are playing a campaign, you can choose to play\n<a href=\"/missions/view/shifting_priorities\">Shifting Priorities</a> instead",
    "battle_length": "At the end of battle round 4, the player with the greatest\nadvantage must roll a D6. On a 3+, the game continues,\notherwise the game is over. If the battle doesn’t end as\ndescribed above, at the end of battle round 5, the player\nwith the greatest advantage must roll a D6. This time the\ngame continues on a 4+, otherwise the game is over. The\nbattle automatically ends at the end of battle round 6.",
    "deployment": "The players each roll 2D6. The highest scorer has the\ngreatest strategic advantage in this mission, the next\nhighest gets the second greatest advantage and so on.\nAny players who roll the same result roll their dice again\nto determine which of them has a greater advantage.\nThe players then take it in turn, in the order of greatest\nto least advantage, to choose their deployment zone.\nThe players then take it in turn to deploy one model\nfrom their kill team, in the order of least to greatest\nadvantage. Models must be set up wholly within their\nown deployment zone. Once all players have set up one\nmodel, they do so again in the same order, and so on. If\na player runs out of models to set up, skip them. Once\nthe players have set up all their models, deployment\nends and the first battle round begins.",
    "description": "An enemy force whose nerve has failed them is little more than a gaggle of victims waiting to be\nslaughtered. Some commanders deploy kill teams on dedicated terror raids, their mission to spread as\nmuch panic and confusion as possible, scattering the foe and punching through their lines.",
    "four_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fterror_tactics_4_player_map.png?alt=media&token=e45a5420-4d61-4e9c-a9c5-61ed2eb4f728",
    "page": "59",
    "resources": "In a campaign game (see page 202) the player(s) that\nlose the mission each lose 2 Morale. If players draw they\ndo not lose Morale.",
    "scouting_phase": "Resolve the Scouting phase as described on page 49.",
    "source": "Core Rulebook",
    "specialRules": "Any player can move their models off the battlefield\nedge directly opposite their own deployment zone in the\nMovement phase, if that model’s move is sufficient to\ntake it wholly over that battlefield edge. A model that\ndoes so has broken through the enemy lines and takes\nno further part in the mission (it is not considered to be\nout of action).",
    "specialRulesTitle": "Wreak Havoc",
    "the_battlefield": "Create the battlefield and set up terrain. An example of\nhow you might do this is shown below.",
    "the_kill_teams": "This is a mission for two to four players. Each player\nchooses a Faction keyword, and the players reveal their\nchoices at the same time. Then each player chooses a\nBattle-forged kill team (see page 62) that only includes\nmodels with the Faction keyword they chose.",
    "title": "Terror Tactics",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fterror_tactics_2_player_map.png?alt=media&token=8907686d-8d44-436b-9d11-01be9102cbef",
    "type": "Matched Play Mission",
    "uuid": "terror_tactics",
    "victory_conditions": "Each player scores 2 victory points for each of their\nmodels that have broken through enemy lines (see\nbelow), and 1 victory point for each enemy model taken\nout of action by one of their model’s attacks or psychic\npowers. The player with the most victory points is the\nwinner. If there is a tie, whichever of those players had the\nlower Force (see page 19) is the winner. If there is still a\ntie, the tied players draw and any other players lose."
  },
  {
    "id": "tip_of_the_spear",
    "alternative_mission": "If you are playing a campaign, you can choose to play this mission instead of the <a href=\"/missions/view/ambush\">Ambush</a> mission.",
    "attackerTactic": "speartip_strike",
    "battle_length": "Use the Variable Battle Length rules (Commanders, pg 19) - the player with the initiative in that battle round rolls. In addition, if there is only one unbroken kill team on the battlefield at the end of a battle round, the battle ends.",
    "contributor": "DestructorNZ",
    "defenderTactic": "hold_your_ground!",
    "deployment": "The players alternate setting up models, starting with the defender. If a player runs out of models to set up, skip them. Continue setting up models until both players have set up their kill team. A player's models must be set up wholly within their deployment zone. Once the players have set up all of their models, deployment ends and the first battle round begins.",
    "description": "Commanders are often found at the head of an important offensive, fighting from the front to ensure the success of the attack. When faced with such a formidable adversary, the enemy must redouble their efforts lest their line be overrun.",
    "page": "110",
    "requiresCommander": true,
    "resources": "In a campaign game, if the attacker wins the mission, the defender loses 2 Territory. If the defender wins the mission, the attacker loses 1 Morale.",
    "scouting_phase": "Resolve the Scouting phase as described in the Kill Team Core Manual.",
    "source": "Commanders Rulebook",
    "the_battlefield": "Create the battlefield and set up terrain. An example of how you might do this is shown below.",
    "the_kill_teams": "This is a mission for two players. Choose which player will be the attacker and which will be the defender (roll off if you can't agree - the winner decides). Each player chooses a Faction keyword, and the players reveal their choices at the same time. Then each player chooses a Battle-forged kill team (see the Kill Team Core Manual) that only includes models with the Faction keyword they chose. Each kill team can cost up to 200 points. The attacker must include one Commander in their kill team, and the defender cannot include a Commander.",
    "title": "Tip of the Spear",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Ftip_of_the_spear.png?alt=media&token=725ff95b-ae42-42ed-a627-32130885bfbd",
    "type": "Narrative Play Mission",
    "uuid": "tip_of_the_spear",
    "victory_conditions": "If the battle ends because there is only one unbroken kill team on the battlefield, that kill team's player wins. Otherwise, at the end of the game, the attacker scores 3 victory points if their Commander is wholly within the defender's deployment zone, and 1 victory point for each other model from their kill team that is wholly within the defender's deployment zone. The defender scores 3 victory points if the enemy Commander was taken out of action, and 1 victory point for each other enemy model that was taken out of action. The player with the most victory points is the winner. If there is a tie, the attacker wins if their Commander is still on the battlefield, otherwise the defender wins."
  },
  {
    "id": "vital_sabotage",
    "alternative_mission": "If you are playing a campaign, you can choose to play\nthis mission instead of the <a href=\"/missions/view/assassinate\">Assassinate</a> mission.",
    "attackerTactic": "only_the_mission_matters",
    "battle_length": "Use the Variable Battle Length rules (pg 14) – the\nattacker rolls. In addition, if the target is sabotaged (see\nbelow), the battle ends.",
    "defenderTactic": "desperate_defender",
    "deployment": "The players alternate setting up models, starting with the\ndefender. If a player runs out of models to set up, skip\nthem. Continue setting up models until both players\nhave set up their kill team. A player’s models must be\nset up wholly within their deployment zone. Once the\nplayers have set up all of their models, deployment ends\nand the first battle round begins.",
    "description": "There are some targets that are so vital to one side of a war that their opponents are willing to pay any\nprice to see them destroyed. In one such case, a crack team is sent with orders to sabotage the target, and\nif necessary to die trying.",
    "page": "136",
    "resources": "In a campaign game, if the attacker wins the mission,\nthe defender loses 1 Intelligence and 1 Morale. If the\ndefender wins the mission, the attacker loses 1 Morale.",
    "scouting_phase": "Resolve the Scouting phase as described in the Kill Team\nCore Manual.",
    "source": "Elites Rulebook",
    "specialRules": "If the attacker controls an objective marker at the end\nof a battle round, the defender must reveal its number.\nIf it is numbered 1 or 2, remove it from the battlefield.\nIf it is numbered 3, it is the target, and the attacker may\nattempt to sabotage it: to do so, they roll a D6 for each\nmodel (other than shaken models) from their kill team\nthat is within 2\" of that objective marker. On any roll of\n6+, the target is sabotaged.",
    "specialRulesTitle": "Sabotage",
    "the_battlefield": "Create the battlefield and set up terrain. An example of\nhow you might do this is shown below. The defender\nplaces three objective markers in their deployment zone,\nand secretly numbers them 1, 2 and 3 (they should note\nthis down, or if you are using Kill Team tokens, simply\nplace the objective markers with the numbered side\ndown). Each objective marker must be at least 6\" from\nother objective markers and the edge of the battlefield.",
    "the_kill_teams": "This is a mission for two players. Choose which player\nwill be the attacker and which will be the defender (roll\noff if you can’t agree – the winner decides). Each player\nchooses a Faction keyword, and the players reveal their\nchoices at the same time. Then each player chooses a\nBattle-forged kill team (see the Kill TeamCore Manual)\nthat only includes models with the Faction keyword\nthey chose. Each kill team can cost up to 125 points.",
    "title": "Vital Sabotage",
    "two_player_map": "https://firebasestorage.googleapis.com/v0/b/warhammer40k-killteam-missions.appspot.com/o/maps%2Fvital_sabotage.png?alt=media&token=da3b932a-4cdb-45a8-946f-fa8e08c1ab93",
    "type": "Narrative Play Mission",
    "uuid": "vital_sabotage",
    "victory_conditions": "If, at the end of the battle, the target has been sabotaged,\nthe attacker wins. Otherwise, the defender wins."
  }
]